{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\Achim.Ahrens\Dropbox\StataLasso\Current\cs_cvlasso.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res} 5 Apr 2018, 12:41:29
{txt}r; t=0.00 12:41:29

{com}. about

{txt}Stata/SE 14.2 for Windows (64-bit x86-64)
Revision 13 Jul 2017
Copyright 1985-2015 StataCorp LLC

Total physical memory:    {res}16671324 KB
{txt}Available physical memory: {res}9055884 KB

45-user Stata network perpetual license:
       Serial number:  401406293350
         Licensed to:  Achim Ahrens
                       ESRI
{txt}r; t=0.00 12:41:29

{com}. which cvlasso
{txt}.\cvlasso.ado
{res}*! lassocv 1.0.06 24mar2018
*! authors aa/ms
{txt}r; t=0.00 12:41:29

{com}. which lasso2
{txt}.\lasso2.ado
{res}*! lasso2 1.0.05 4apr2018
*! authors aa/ms
{txt}r; t=0.00 12:41:29

{com}. which lasso2_p
{txt}.\lasso2_p.ado
{res}*! lasso2_p 1.0.02 05/04/2018
*! authors aa/ms
{txt}r; t=0.01 12:41:29

{com}. which lassoutils
{txt}.\lassoutils.ado
{res}*! lassoutils 1.0.08 4apr2018
*! authors aa/cbh/ms
{txt}r; t=0.00 12:41:29

{com}. 
. * data source
. global prostate prostate.data
{txt}r; t=0.00 12:41:29

{com}. //global prostate https://web.stanford.edu/~hastie/ElemStatLearn/datasets/prostate.data
. 
. * program to compare two matrices in terms of avg abs deviation
. cap program drop comparemat
{txt}r; t=0.00 12:41:29

{com}. program define comparemat , rclass
{txt}  1{com}.         syntax anything [, tol(real 10e-3)] 
{txt}  2{com}.         local A         : word 1 of `0'
{txt}  3{com}.         local B         : word 2 of `0'
{txt}  4{com}.         tempname Amat Bmat
{txt}  5{com}.         mat `Amat' = `A'
{txt}  6{com}.         mat `Bmat' = `B'
{txt}  7{com}.         local diff=mreldif(`Amat',`Bmat')
{txt}  8{com}.         di as text "mreldif=`diff'. tolerance = `tol'"
{txt}  9{com}.         mat list `Amat'
{txt} 10{com}.         mat list `Bmat'
{txt} 11{com}.         return scalar mreldif = `diff'
{txt} 12{com}.         assert `diff'<`tol'
{txt} 13{com}. end
{txt}r; t=0.00 12:41:29

{com}. 
. 
. ********************************************************************************
. *** compare with glmnet                                                                  ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:41:29

{com}. drop if _n==97 // to ensure same size for each fold
{txt}(1 observation deleted)
r; t=0.00 12:41:29

{com}. 
. global model lpsa lcavol lweight age lbph svi lcp gleason pgg45
{txt}r; t=0.00 12:41:29

{com}. 
. * generate fold variable
. gen myfid = 1 if _n<=32
{txt}(64 missing values generated)
r; t=0.00 12:41:29

{com}. replace myfid = 2 if _n>32 & _n<=64
{txt}(32 real changes made)
r; t=0.00 12:41:29

{com}. replace myfid = 3 if _n>64
{txt}(32 real changes made)
r; t=0.00 12:41:29

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5)
{txt}Use user-specified fold variable.
K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.3865184 {space 3} {res} 1.1559279  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4635023 {space 3} {res} .42894674  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.485229 {space 3} {res} .36948736  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=0.13 12:41:30

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:41:30

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 2.386518 1.463497 1.484953
> > var(predict(c,newx=X,s="lambda.min"))
>          1
> 1 0.608541
> */
. mat G = ( 2.38651835211576 \ 1.46349718052732 \ 1.48495268875459 )
{txt}r; t=0.00 12:41:30

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0001112103984058. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.3865184
{txt}c2 {res} 1.4635023
{txt}c3 {res}  1.485229
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.3865184
{txt}r2 {res} 1.4634972
{txt}r3 {res} 1.4849527
{reset}r; t=0.01 12:41:30

{com}. cap drop xb
{txt}r; t=0.00 12:41:30

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4705447      0.4939937
{txt}{space 10}lweight {c |}{col 21}{res}      0.4738822      0.5463838
{txt}{space 13}lbph {c |}{col 21}{res}      0.0222266      0.0675109
{txt}{space 14}svi {c |}{col 21}{res}      0.4597209      0.5816563
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021287      0.0033429
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0467006     -0.4001276
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 12:41:30

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .7801003   .9116189   4.111986
{txt}r; t=0.00 12:41:30

{com}. assert reldif(0.608541,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:41:30

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) prestd
{txt}Use user-specified fold variable.
K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.3865184 {space 3} {res} 1.1559279  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4635023 {space 3} {res} .42894674  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.485229 {space 3} {res} .36948736  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=0.03 12:41:30

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:41:30

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 2.386518 1.463497 1.484953
> > var(predict(c,newx=X,s="lambda.min"))
>          1
> 1 0.608541
> */
. mat G = ( 2.38651835211576 \ 1.46349718052732 \ 1.48495268875459 )
{txt}r; t=0.00 12:41:30

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0001112103968545. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.3865184
{txt}c2 {res} 1.4635023
{txt}c3 {res}  1.485229
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.3865184
{txt}r2 {res} 1.4634972
{txt}r3 {res} 1.4849527
{reset}r; t=0.00 12:41:30

{com}. cap drop xb
{txt}r; t=0.00 12:41:30

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4705447      0.4939937
{txt}{space 10}lweight {c |}{col 21}{res}      0.4738822      0.5463838
{txt}{space 13}lbph {c |}{col 21}{res}      0.0222266      0.0675109
{txt}{space 14}svi {c |}{col 21}{res}      0.4597209      0.5816563
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021287      0.0033429
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.0467006     -0.4001276
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.05 12:41:30

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .7801003   .9116189   4.111986
{txt}r; t=0.00 12:41:30

{com}. assert reldif(0.608541,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:41:30

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) unitload
{txt}Use user-specified fold variable.
K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 2.1036977 {space 3} {res} .86238904  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.4298598 {space 3} {res} .47710985  ^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res} 1.4275375 {space 3} {res} .35365915  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=0.02 12:41:30

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:41:30

{com}. /*
> > # cross-validation with intercept & standardisation
> > c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=TRUE,standardize=FALSE)
> > c$cvm # mean-squared prediction error
> [1] 2.103697 1.429934 1.427561
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.7840688
> */ 
. mat G = ( 2.10369705382686 \ 1.42993421234064 \ 1.42756055333919 )
{txt}r; t=0.00 12:41:30

{com}. comparemat L G // compare coeffs
{txt}mreldif=.000030615518138. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 2.1036977
{txt}c2 {res} 1.4298598
{txt}c3 {res} 1.4275375
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 2.1036971
{txt}r2 {res} 1.4299342
{txt}r3 {res} 1.4275606
{reset}r; t=0.00 12:41:30

{com}. cap drop xb
{txt}r; t=0.00 12:41:30

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=1.5 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.5568426      0.5653571
{txt}{space 10}lweight {c |}{col 21}{res}      0.5707438      0.6139211
{txt}{space 14}age {c |}{col 21}{res}     -0.0208973     -0.0224946
{txt}{space 13}lbph {c |}{col 21}{res}      0.0911393      0.0935981
{txt}{space 14}svi {c |}{col 21}{res}      0.6204808      0.7149700
{txt}{space 14}lcp {c |}{col 21}{res}     -0.1126800     -0.1447125
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0068648      0.0071245
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}      0.6415930      0.5426554
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=1.5).
r; t=0.01 12:41:30

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446048    .8854875    .513909   4.598263
{txt}r; t=0.00 12:41:30

{com}. assert reldif(0.7840688,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:41:30

{com}. 
. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons unitload
{txt}Use user-specified fold variable.
K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9998833 {space 3} {res} .72964224  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res}   1.26607 {space 3} {res} .39073554  ^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.246129 {space 3} {res} .28903645  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}r; t=0.08 12:41:30

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:41:30

{com}. /*
> > c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=FALSE)
> > c$cvm # mean-squared prediction error
> [1] 1.999806 1.266384 1.246805
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.7919695
> */
. mat G = ( 1.99980614859113 \ 1.26638436668758 \ 1.24680539174676 )
{txt}r; t=0.00 12:41:30

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0003010649455664. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9998833
{txt}c2 {res}   1.26607
{txt}c3 {res}  1.246129
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9998061
{txt}r2 {res} 1.2663844
{txt}r3 {res} 1.2468054
{reset}r; t=0.00 12:41:30

{com}. cap drop xb
{txt}r; t=0.00 12:41:30

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=1.5 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.5473610      0.5569029
{txt}{space 10}lweight {c |}{col 21}{res}      0.6258035      0.6453516
{txt}{space 14}age {c |}{col 21}{res}     -0.0188110     -0.0217852
{txt}{space 13}lbph {c |}{col 21}{res}      0.0801178      0.0880196
{txt}{space 14}svi {c |}{col 21}{res}      0.6260775      0.7250462
{txt}{space 14}lcp {c |}{col 21}{res}     -0.1142476     -0.1460891
{txt}{space 10}gleason {c |}{col 21}{res}      0.0505847      0.0620963
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0059407      0.0060062
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=1.5).
r; t=0.02 12:41:30

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.443933    .8905195   .5327895   4.561406
{txt}r; t=0.00 12:41:30

{com}. assert reldif(0.7919695,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:41:30

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons
{txt}Use user-specified fold variable.
K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9069161 {space 3} {res} .92525083  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.2339936 {space 3} {res} .35347077  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.309495 {space 3} {res}  .3270498  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=0.08 12:41:30

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:41:30

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 1.906526 1.232220 1.310531
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.6062457
> */
. mat G = ( 1.90652583524832 \ 1.23222044017428 \ 1.31053116174191 )
{txt}r; t=0.00 12:41:30

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0007943382997762. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9069161
{txt}c2 {res} 1.2339936
{txt}c3 {res}  1.309495
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9065258
{txt}r2 {res} 1.2322204
{txt}r3 {res} 1.3105312
{reset}r; t=0.00 12:41:30

{com}. cap drop xb
{txt}r; t=0.00 12:41:30

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4712765      0.5002634
{txt}{space 10}lweight {c |}{col 21}{res}      0.4608978      0.4351342
{txt}{space 13}lbph {c |}{col 21}{res}      0.0239597      0.0823598
{txt}{space 14}svi {c |}{col 21}{res}      0.4613426      0.5955516
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021037      0.0031282
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 12:41:30

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446541    .7785216   .9124108     4.1091
{txt}r; t=0.00 12:41:30

{com}. assert reldif(0.6062457,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:41:30

{com}. 
. cvlasso $model, foldvar(myfid) lambda(150 15 1.5) nocons prestd
{txt}Use user-specified fold variable.
K-fold cross-validation with 3 folds. Elastic net with alpha=1.
Fold {res}1 2 3 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}       150 {space 3} {res} 1.9069161 {space 3} {res} .92525083  
{txt}         2{c |} {space 3} {res}        15 {space 3} {res} 1.2339936 {space 3} {res} .35347077  *^
{txt}         3{c |} {space 3} {res}       1.5 {space 3} {res}  1.309495 {space 3} {res}  .3270498  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=0.10 12:41:30

{com}. mat L = e(mmspe)
{txt}r; t=0.00 12:41:30

{com}. /*
> c<-cv.glmnet(X,y,foldid=fid,lambda=c(150, 15, 1.5)/(2*n),keep=TRUE, intercept=FALSE,standardize=TRUE)
> > c$cvm # mean-squared prediction error
> [1] 1.906526 1.232220 1.310531
> > var(predict(c,newx=X,s="lambda.min"))
>           1
> 1 0.6062457
> */
. mat G = ( 1.90652583524832 \ 1.23222044017428 \ 1.31053116174191 )
{txt}r; t=0.00 12:41:30

{com}. comparemat L G // compare coeffs
{txt}mreldif=.0007943382600105. tolerance = .01
{res}
{txt}__000000[3,1]
           r1
c1 {res} 1.9069161
{txt}c2 {res} 1.2339936
{txt}c3 {res}  1.309495
{reset}{res}
{txt}__000001[3,1]
           c1
r1 {res} 1.9065258
{txt}r2 {res} 1.2322204
{txt}r3 {res} 1.3105312
{reset}r; t=0.00 12:41:30

{com}. cap drop xb
{txt}r; t=0.00 12:41:30

{com}. predict double xb, lopt
{txt}Estimate lasso with lambda=15 (lopt).
{res}
{txt}{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.4712765      0.5002634
{txt}{space 10}lweight {c |}{col 21}{res}      0.4608978      0.4351342
{txt}{space 13}lbph {c |}{col 21}{res}      0.0239597      0.0823598
{txt}{space 14}svi {c |}{col 21}{res}      0.4613426      0.5955516
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0021037      0.0031282
{txt}{hline 18}{c BT}{hline 32}
No xb or residuals options specified. Assume xb (fitted values).
Use e(b) from previous lasso2 estimation (lambda=15).
r; t=0.01 12:41:30

{com}. sum xb

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 10}xb {c |}{res}         96    2.446541    .7785216   .9124108     4.1091
{txt}r; t=0.00 12:41:30

{com}. assert reldif(0.6062457,r(Var))<0.001 // compare predicted values
{txt}r; t=0.00 12:41:30

{com}. 
. 
. ********************************************************************************
. *** validate                                                        ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:41:30

{com}.  
. global model lpsa lcavol lweight age lbph svi lcp gleason pgg45
{txt}r; t=0.00 12:41:30

{com}. gen sample = _n<70 
{txt}r; t=0.00 12:41:30

{com}.  
. foreach type of newlist lopt lse {c -(} 
{txt}  2{com}.  
. local type lse 
{txt}  3{com}.  
. // check that right beta is used for predict
. // also validates that "if" works 
. cvlasso $model if sample
{txt}  4{com}. local mylopt = e(`type')
{txt}  5{com}. cap drop myxb  
{txt}  6{com}. predict double myxb if !sample, xb `type' postest
{txt}  7{com}. mat A = e(b)
{txt}  8{com}. 
. lasso2 $model if sample, lambda(`mylopt')
{txt}  9{com}. cap drop myxb2
{txt} 10{com}. predict double myxb2 if !sample, xb
{txt} 11{com}. mat B = e(b)
{txt} 12{com}. 
. comparemat A B
{txt} 13{com}. assert myxb2==myxb
{txt} 14{com}. 
. // and now with alpha list
. cvlasso $model if sample, alpha(0 0.3 0.7 1)
{txt} 15{com}. local mylopt = e(`type')
{txt} 16{com}. local myalpha = e(alphamin)
{txt} 17{com}. cap drop myr
{txt} 18{com}. predict double myr if !sample, r `type' postest
{txt} 19{com}. mat A = e(b)
{txt} 20{com}. 
. lasso2 $model if sample, lambda(`mylopt') alpha(`myalpha') 
{txt} 21{com}. cap drop myr2
{txt} 22{com}. predict double myr2 if !sample, r
{txt} 23{com}. mat B = e(b)
{txt} 24{com}. 
. comparemat A B
{txt} 25{com}. assert myr2==myr
{txt} 26{com}. 
. {c )-}
{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .72620539 {space 3} {res} .13886732  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .72039158 {space 3} {res} .13893088  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .69314941 {space 3} {res}  .1325496  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .65622539 {space 3} {res} .12191522  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .61633745 {space 3} {res} .10925187  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .58310184 {space 3} {res}   .098461  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .55681145 {space 3} {res} .08901176  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .53503199 {space 3} {res} .08100708  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .51694316 {space 3} {res} .07442337  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .50239581 {space 3} {res} .06912685  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .49067266 {space 3} {res} .06478173  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res}  .4809376 {space 3} {res} .06131396  ^
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res}  .4718644 {space 3} {res} .05832651  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .46418915 {space 3} {res} .05588435  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .45700422 {space 3} {res} .05424221  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .45081211 {space 3} {res} .05306788  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .44530036 {space 3} {res} .05215357  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .44077589 {space 3} {res}  .0515317  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .43706651 {space 3} {res} .05115076  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .43458831 {space 3} {res} .05114767  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .43361925 {space 3} {res} .05158643  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .43292279 {space 3} {res} .05200611  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .43294756 {space 3} {res} .05243324  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .43335154 {space 3} {res} .05290274  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .43383219 {space 3} {res} .05343145  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .43412829 {space 3} {res} .05426866  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .43468261 {space 3} {res} .05517208  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .43484263 {space 3} {res}  .0560502  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .43448233 {space 3} {res} .05710008  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .43376757 {space 3} {res} .05821414  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .43227426 {space 3} {res} .05929211  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .43028937 {space 3} {res} .06001708  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res}  .4284871 {space 3} {res} .06079289  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .42685934 {space 3} {res} .06158199  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .42536586 {space 3} {res} .06236947  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .42401114 {space 3} {res} .06308191  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .42270293 {space 3} {res} .06366971  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res}  .4216182 {space 3} {res} .06420395  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .42064299 {space 3} {res} .06469646  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .41982684 {space 3} {res} .06514387  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .41914431 {space 3} {res} .06555007  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .41857315 {space 3} {res} .06591878  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .41809485 {space 3} {res} .06625343  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .41769402 {space 3} {res} .06655719  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .41735782 {space 3} {res} .06683292  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .4170756 {space 3} {res} .06708324  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .41683847 {space 3} {res} .06731054  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .41663901 {space 3} {res} .06751696  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .41647107 {space 3} {res} .06770446  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res}  .4163295 {space 3} {res} .06787481  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .41621001 {space 3} {res}  .0680296  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .41610903 {space 3} {res} .06817028  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .41602357 {space 3} {res} .06829817  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .41595115 {space 3} {res} .06841443  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .41588968 {space 3} {res} .06852016  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .41583741 {space 3} {res} .06861631  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .41579291 {space 3} {res} .06870377  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .41575494 {space 3} {res} .06878334  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .41572249 {space 3} {res} .06885573  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .41569471 {space 3} {res}  .0689216  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .41567087 {space 3} {res} .06898155  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .41565038 {space 3} {res} .06903611  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .41563272 {space 3} {res} .06908577  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .41561749 {space 3} {res} .06913098  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .41560431 {space 3} {res} .06917213  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .41559288 {space 3} {res}  .0692096  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .41558295 {space 3} {res} .06924372  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .41557431 {space 3} {res} .06927478  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .41556677 {space 3} {res} .06930307  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .41556017 {space 3} {res} .06932883  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .41555439 {space 3} {res} .06935229  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .41554932 {space 3} {res} .06937366  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .41554486 {space 3} {res} .06939312  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .41554092 {space 3} {res} .06941084  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .41553744 {space 3} {res} .06942699  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .41553436 {space 3} {res} .06944169  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .41553163 {space 3} {res} .06945509  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .41552921 {space 3} {res} .06946729  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .41552705 {space 3} {res}  .0694784  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .41552513 {space 3} {res} .06948853  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .41552342 {space 3} {res} .06949775  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .41552188 {space 3} {res} .06950616  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .41552051 {space 3} {res} .06951381  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .41551928 {space 3} {res} .06952079  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .41551818 {space 3} {res} .06952714  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .41551718 {space 3} {res} .06953293  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .41551629 {space 3} {res}  .0695382  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .41551549 {space 3} {res} .06954301  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .41551477 {space 3} {res} .06954738  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .41551411 {space 3} {res} .06955137  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .41551352 {space 3} {res}   .069555  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .41551299 {space 3} {res} .06955831  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .41551251 {space 3} {res} .06956133  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .41551208 {space 3} {res} .06956408  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .41551168 {space 3} {res} .06956658  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .41551133 {space 3} {res} .06956886  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res}   .415511 {space 3} {res} .06957094  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .41551071 {space 3} {res} .06957284  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .41551045 {space 3} {res} .06957456  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res}  .4155102 {space 3} {res} .06957613  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}Estimate lasso with lambda=23.31086996759306 (lse).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2387964      0.3133772
{txt}{space 10}lweight {c |}{col 21}{res}      0.5044514      0.7280125
{txt}{space 13}lbph {c |}{col 21}{res}      0.0024629      0.0661405
{txt}{space 10}gleason {c |}{col 21}{res}      0.0188429      0.1878900
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.1940679     -2.1878029
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=23.31086996759).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2387964      0.3133772
{txt}{space 10}lweight {c |}{col 21}{res}      0.5044514      0.7280125
{txt}{space 13}lbph {c |}{col 21}{res}      0.0024629      0.0661405
{txt}{space 10}gleason {c |}{col 21}{res}      0.0188429      0.1878900
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.1940679     -2.1878029
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=23.31086996759).
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,5]
        lcavol     lweight        lbph     gleason       _cons
y1 {res}  .23879637   .50445142   .00246288   .01884288  -.19406794
{reset}{res}
{txt}__000001[1,5]
        lcavol     lweight        lbph     gleason       _cons
y1 {res}  .23879637   .50445142   .00246288   .01884288  -.19406794
{reset}K-fold cross-validation with 10 folds. Elastic net with alpha=0.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .39922377 {space 3} {res} .07595415  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .39675979 {space 3} {res} .07617545  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .39455684 {space 3} {res} .07643865  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .39261701 {space 3} {res} .07673822  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .39093069 {space 3} {res} .07707113  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .38948662 {space 3} {res} .07743391  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .38827203 {space 3} {res} .07782274  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .38727283 {space 3} {res} .07823355  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .38647385 {space 3} {res}  .0786621  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .38585918 {space 3} {res} .07910413  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .38541238 {space 3} {res} .07955539  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .38511682 {space 3} {res}  .0800118  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .38495594 {space 3} {res} .08046951  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .38491348 {space 3} {res} .08092492  *
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .38497376 {space 3} {res} .08137481  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res}  .3851218 {space 3} {res}  .0818163  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .38534353 {space 3} {res}  .0822469  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .38562586 {space 3} {res} .08266451  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .38595682 {space 3} {res} .08306743  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .38632552 {space 3} {res}  .0834543  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .38672225 {space 3} {res} .08382413  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .38713839 {space 3} {res} .08417621  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .38756644 {space 3} {res} .08451016  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .38799994 {space 3} {res}  .0848258  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .38843339 {space 3} {res}  .0851232  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .38886222 {space 3} {res}  .0854026  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .38928265 {space 3} {res} .08566438  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .38969168 {space 3} {res} .08590905  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .39008692 {space 3} {res} .08613723  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .39046661 {space 3} {res} .08634958  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .39082946 {space 3} {res} .08654684  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .39117462 {space 3} {res} .08672975  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res}  .3915016 {space 3} {res} .08689911  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .39181024 {space 3} {res} .08705569  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .39210059 {space 3} {res} .08720027  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .39237294 {space 3} {res}  .0873336  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .39262771 {space 3} {res} .08745644  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .39286547 {space 3} {res} .08756949  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .39308687 {space 3} {res} .08767344  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .39329263 {space 3} {res} .08776895  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .39348352 {space 3} {res} .08785663  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .39366031 {space 3} {res} .08793708  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .39382382 {space 3} {res} .08801084  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .39397483 {space 3} {res} .08807843  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .39411413 {space 3} {res} .08814034  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .3942425 {space 3} {res} .08819701  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39436066 {space 3} {res} .08824888  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39446933 {space 3} {res} .08829632  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39456919 {space 3} {res}  .0883397  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39466088 {space 3} {res} .08837936  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .39474502 {space 3} {res}  .0884156  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .39482217 {space 3} {res} .08844871  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .39489289 {space 3} {res} .08847896  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39495766 {space 3} {res} .08850658  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .39501697 {space 3} {res} .08853179  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39507125 {space 3} {res} .08855481  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .3951209 {space 3} {res} .08857582  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .39516631 {space 3} {res} .08859499  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39520782 {space 3} {res} .08861249  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39524576 {space 3} {res} .08862845  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39528043 {space 3} {res} .08864301  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res}  .3953121 {space 3} {res} .08865629  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .39534102 {space 3} {res}  .0886684  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39536742 {space 3} {res} .08867944  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .39539153 {space 3} {res} .08868952  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .39541353 {space 3} {res}  .0886987  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .39543361 {space 3} {res} .08870708  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .39545193 {space 3} {res} .08871471  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39546865 {space 3} {res} .08872167  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res}  .3954839 {space 3} {res} .08872802  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .39549781 {space 3} {res}  .0887338  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res}  .3955105 {space 3} {res} .08873907  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39552207 {space 3} {res} .08874388  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39553262 {space 3} {res} .08874826  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .39554224 {space 3} {res} .08875225  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .39555101 {space 3} {res} .08875589  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .39555901 {space 3} {res} .08875921  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res}  .3955663 {space 3} {res} .08876223  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .39557295 {space 3} {res} .08876498  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .39557901 {space 3} {res} .08876749  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .39558453 {space 3} {res} .08876978  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .39558957 {space 3} {res} .08877187  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .39559416 {space 3} {res} .08877377  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39559834 {space 3} {res}  .0887755  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .39560215 {space 3} {res} .08877708  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .39560563 {space 3} {res} .08877851  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .39560879 {space 3} {res} .08877982  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39561168 {space 3} {res} .08878102  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39561431 {space 3} {res} .08878211  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39561671 {space 3} {res}  .0887831  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .39561889 {space 3} {res}   .088784  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39562088 {space 3} {res} .08878482  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res}  .3956227 {space 3} {res} .08878557  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39562435 {space 3} {res} .08878626  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .39562586 {space 3} {res} .08878688  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .39562723 {space 3} {res} .08878745  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .39562848 {space 3} {res} .08878797  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39562962 {space 3} {res} .08878844  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39563066 {space 3} {res} .08878887  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39563161 {space 3} {res} .08878926  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.

{txt}K-fold cross-validation with 10 folds. Square-root LASSO estimator.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .44571633 {space 3} {res} .07550969  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .43554509 {space 3} {res} .07448902  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .42688443 {space 3} {res} .07368065  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .41955616 {space 3} {res} .07306423  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .41333619 {space 3} {res}  .0725889  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .40812831 {space 3} {res} .07226335  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .40377016 {space 3} {res} .07205743  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .40044188 {space 3} {res} .07206578  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .39864423 {space 3} {res}  .0724935  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .39735266 {space 3} {res}  .0729697  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .39646846 {space 3} {res} .07348174  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .39634112 {space 3} {res} .07406463  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .39664564 {space 3} {res} .07472054  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .39710995 {space 3} {res} .07527756  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .39763013 {space 3} {res} .07576057  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .39795645 {space 3} {res} .07621726  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res}  .3985014 {space 3} {res} .07668813  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .39894589 {space 3} {res} .07712049  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .39827317 {space 3} {res} .07746444  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .39754634 {space 3} {res} .07794636  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .39675468 {space 3} {res} .07850563  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .39610377 {space 3} {res}  .0791097  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .39557369 {space 3} {res} .07975823  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .39475981 {space 3} {res} .08039603  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .39430007 {space 3} {res} .08099065  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .39383477 {space 3} {res} .08157516  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .39343319 {space 3} {res} .08213424  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res}  .3931495 {space 3} {res} .08265659  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .39296196 {space 3} {res} .08314345  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .39285208 {space 3} {res} .08359626  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .39280426 {space 3} {res} .08401657  *
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .39280541 {space 3} {res} .08440605  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .39284461 {space 3} {res}  .0847664  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .39291279 {space 3} {res} .08509932  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .39300249 {space 3} {res} .08540653  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .39310758 {space 3} {res} .08568968  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res}  .3932231 {space 3} {res} .08595038  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .39334507 {space 3} {res}  .0861902  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .39347028 {space 3} {res} .08641061  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .39359624 {space 3} {res} .08661303  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .39372098 {space 3} {res}  .0867988  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .39384304 {space 3} {res} .08696918  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .39396128 {space 3} {res} .08712535  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .39407493 {space 3} {res} .08726842  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .39418343 {space 3} {res} .08739943  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .39428644 {space 3} {res} .08751934  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39438375 {space 3} {res} .08762904  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39447532 {space 3} {res} .08772938  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39456117 {space 3} {res} .08782112  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39464142 {space 3} {res} .08790496  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .39471623 {space 3} {res} .08798158  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res}  .3947858 {space 3} {res} .08805157  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .39485036 {space 3} {res} .08811549  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39491016 {space 3} {res} .08817386  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .39496547 {space 3} {res} .08822715  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39501654 {space 3} {res} .08827579  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .39506364 {space 3} {res} .08832018  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .39510702 {space 3} {res} .08836069  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39514695 {space 3} {res} .08839765  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39518365 {space 3} {res} .08843137  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39521737 {space 3} {res} .08846212  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .39524831 {space 3} {res} .08849017  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .39527669 {space 3} {res} .08851576  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39530271 {space 3} {res} .08853909  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .39532655 {space 3} {res} .08856037  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .39534837 {space 3} {res} .08857976  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .39537233 {space 3} {res} .08859832  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .39539585 {space 3} {res} .08861559  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39541734 {space 3} {res} .08863134  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .39543697 {space 3} {res} .08864569  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .39545491 {space 3} {res} .08865878  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .39547128 {space 3} {res}  .0886707  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39548624 {space 3} {res} .08868157  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39549989 {space 3} {res} .08869148  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .39551235 {space 3} {res} .08870051  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .39552372 {space 3} {res} .08870874  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res}  .3955341 {space 3} {res} .08871624  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .39554356 {space 3} {res} .08872308  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res}  .3955522 {space 3} {res} .08872931  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .39556007 {space 3} {res} .08873498  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .39556726 {space 3} {res} .08874016  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .39557381 {space 3} {res} .08874487  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .39557978 {space 3} {res} .08874917  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39558523 {space 3} {res} .08875308  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .39559019 {space 3} {res} .08875665  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .39559472 {space 3} {res}  .0887599  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .39559885 {space 3} {res} .08876287  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39560261 {space 3} {res} .08876557  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39560605 {space 3} {res} .08876803  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39560917 {space 3} {res} .08877027  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .39561202 {space 3} {res} .08877231  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39561462 {space 3} {res} .08877417  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .39561699 {space 3} {res} .08877587  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39561915 {space 3} {res} .08877741  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .39562111 {space 3} {res} .08877882  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .39562291 {space 3} {res} .08878011  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .39562454 {space 3} {res} .08878128  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39562603 {space 3} {res} .08878234  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39562739 {space 3} {res} .08878331  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39562862 {space 3} {res}  .0887842  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.

{txt}K-fold cross-validation with 10 folds. Square-root LASSO estimator.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .58052416 {space 3} {res} .09294185  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .55006314 {space 3} {res}  .0886652  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res}  .5243089 {space 3} {res}  .0850965  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res}  .5036752 {space 3} {res}  .0822698  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .48674481 {space 3} {res} .07979881  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .47240102 {space 3} {res} .07779083  ^
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .45980215 {space 3} {res} .07640528  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .44879469 {space 3} {res} .07533804  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .43916158 {space 3} {res} .07453489  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .42969679 {space 3} {res} .07377808  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .42142609 {space 3} {res} .07307153  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .41465989 {space 3} {res} .07258829  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .40905907 {space 3} {res}  .0722561  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .40447318 {space 3} {res} .07206401  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .40070873 {space 3} {res} .07197702  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .39796499 {space 3} {res} .07208516  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .39693466 {space 3} {res} .07264829  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .39623363 {space 3} {res} .07320369  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .39611707 {space 3} {res} .07387263  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .39646657 {space 3} {res} .07451334  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .39716167 {space 3} {res} .07522314  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .39813427 {space 3} {res} .07586955  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .39889392 {space 3} {res}  .0763523  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .39954002 {space 3} {res} .07687579  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .40043043 {space 3} {res} .07740773  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .40089786 {space 3} {res} .07785226  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .39999463 {space 3} {res} .07834603  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .39920492 {space 3} {res} .07890125  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res}  .3985813 {space 3} {res} .07946991  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .39799601 {space 3} {res} .08009084  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .39752096 {space 3} {res} .08069392  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .39703929 {space 3} {res}  .0812814  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .39664847 {space 3} {res} .08186456  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .39626651 {space 3} {res} .08244298  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .39574812 {space 3} {res} .08292412  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .39544646 {space 3} {res} .08338253  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .39508709 {space 3} {res} .08387064  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .39487051 {space 3} {res} .08429147  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .39471638 {space 3} {res} .08467746  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .39461204 {space 3} {res} .08503127  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .39454712 {space 3} {res} .08535541  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .39451313 {space 3} {res} .08565223  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .39450316 {space 3} {res}  .0859239  *
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .39451159 {space 3} {res} .08617246  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .39453386 {space 3} {res} .08639979  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .39456632 {space 3} {res} .08660763  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39460603 {space 3} {res} .08679761  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39465065 {space 3} {res}  .0869712  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39469833 {space 3} {res} .08712978  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39474762 {space 3} {res} .08727462  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res}  .3947974 {space 3} {res} .08740688  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .39484681 {space 3} {res} .08752763  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .39489519 {space 3} {res} .08763785  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39494208 {space 3} {res} .08773844  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .39498713 {space 3} {res} .08783024  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39503012 {space 3} {res}   .087914  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .3950709 {space 3} {res} .08799041  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .39510939 {space 3} {res} .08806012  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39514558 {space 3} {res} .08812369  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39517947 {space 3} {res} .08818168  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39521113 {space 3} {res} .08823456  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .39524061 {space 3} {res} .08828278  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res}   .395268 {space 3} {res} .08832675  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39529339 {space 3} {res} .08836684  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res}  .3953169 {space 3} {res} .08840339  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .39533862 {space 3} {res} .08843671  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .39535867 {space 3} {res} .08846709  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .39537715 {space 3} {res} .08849478  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39539415 {space 3} {res} .08852002  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res}  .3954098 {space 3} {res} .08854302  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .39542417 {space 3} {res} .08856399  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .39543736 {space 3} {res} .08858311  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39544947 {space 3} {res} .08860053  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39546057 {space 3} {res} .08861641  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .39547342 {space 3} {res} .08863146  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res}  .3954881 {space 3} {res} .08864583  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .39550152 {space 3} {res} .08865891  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .39551377 {space 3} {res} .08867084  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .39552497 {space 3} {res} .08868171  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .39553519 {space 3} {res} .08869161  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .39554452 {space 3} {res} .08870064  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .39555305 {space 3} {res} .08870886  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .39556082 {space 3} {res} .08871636  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39556792 {space 3} {res} .08872319  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res}  .3955744 {space 3} {res} .08872941  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res}  .3955803 {space 3} {res} .08873508  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .39558569 {space 3} {res} .08874025  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39559061 {space 3} {res} .08874496  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39559509 {space 3} {res} .08874925  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39559918 {space 3} {res} .08875316  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .39560291 {space 3} {res} .08875672  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39560631 {space 3} {res} .08875997  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .39560941 {space 3} {res} .08876293  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39561224 {space 3} {res} .08876562  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .39561481 {space 3} {res} .08876808  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .39561716 {space 3} {res} .08877031  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res}  .3956193 {space 3} {res} .08877235  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39562126 {space 3} {res} .08877421  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39562303 {space 3} {res}  .0887759  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39562466 {space 3} {res} .08877745  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}

K-fold cross-validation with 10 folds. Square-root LASSO estimator.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .71213919 {space 3} {res} .10574872  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .68377862 {space 3} {res} .10361209  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .63796979 {space 3} {res} .09933799  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .59865121 {space 3} {res} .09587935  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .56285516 {space 3} {res} .09108333  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .53261843 {space 3} {res} .08674145  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .50762381 {space 3} {res} .08315959  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .48777997 {space 3} {res} .08062075  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .47239705 {space 3} {res} .07843606  ^
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .45992127 {space 3} {res} .07659108  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res}  .4495803 {space 3} {res} .07516546  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .44055423 {space 3} {res} .07431624  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .43278812 {space 3} {res} .07364446  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .42578161 {space 3} {res}   .073288  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .41840659 {space 3} {res} .07286889  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .41226473 {space 3} {res} .07246197  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res}  .4071064 {space 3} {res} .07220573  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .40296803 {space 3} {res} .07210169  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .39954731 {space 3} {res} .07207356  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .39782135 {space 3} {res} .07247592  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .39708457 {space 3} {res} .07309152  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .39668602 {space 3} {res} .07371893  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res}  .3967801 {space 3} {res} .07431606  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .39719117 {space 3} {res} .07500536  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .39818566 {space 3} {res} .07571771  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .39913908 {space 3} {res} .07626998  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .39981916 {space 3} {res} .07678455  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .40060871 {space 3} {res} .07731901  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .40163084 {space 3} {res} .07787042  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .40110998 {space 3} {res} .07833955  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .40023984 {space 3} {res} .07888368  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .39952329 {space 3} {res} .07944391  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .39888974 {space 3} {res} .08004898  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .39842075 {space 3} {res} .08064896  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .39790689 {space 3} {res} .08124178  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .39750773 {space 3} {res} .08180139  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .39706086 {space 3} {res} .08237297  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .39662991 {space 3} {res} .08291532  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .39619944 {space 3} {res} .08338323  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .39589603 {space 3} {res} .08381736  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .39569185 {space 3} {res} .08420719  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .39536993 {space 3} {res} .08464601  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .39520177 {space 3} {res} .08500757  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .39508025 {space 3} {res} .08533794  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .39499583 {space 3} {res} .08563972  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .39494075 {space 3} {res} .08591533  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .39490871 {space 3} {res}   .086167  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .39489456 {space 3} {res} .08639677  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .39489417 {space 3} {res}  .0866065  *
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .39490419 {space 3} {res} .08679792  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .39492194 {space 3} {res}  .0869726  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .39494527 {space 3} {res} .08713198  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .39497246 {space 3} {res}  .0872774  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .39500216 {space 3} {res} .08741005  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .39503332 {space 3} {res} .08753104  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .39506511 {space 3} {res}  .0876414  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .3950969 {space 3} {res} .08774205  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res}  .3951282 {space 3} {res} .08783383  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .39515867 {space 3} {res} .08791752  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .39518805 {space 3} {res} .08799383  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .39521615 {space 3} {res}  .0880634  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .39524288 {space 3} {res} .08812683  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .39526815 {space 3} {res} .08818466  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .39529194 {space 3} {res} .08823737  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .39531426 {space 3} {res} .08828543  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .39533512 {space 3} {res} .08832923  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .39535457 {space 3} {res} .08836915  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .39537266 {space 3} {res} .08840555  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .39538944 {space 3} {res} .08843871  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .39540498 {space 3} {res} .08846894  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .39541935 {space 3} {res}  .0884965  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .39543261 {space 3} {res} .08852161  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .39544485 {space 3} {res} .08854449  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .39545611 {space 3} {res} .08856535  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .39546647 {space 3} {res} .08858435  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res}   .395476 {space 3} {res} .08860167  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .39548474 {space 3} {res} .08861746  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .39549277 {space 3} {res} .08863184  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .39550488 {space 3} {res} .08864599  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res}  .3955168 {space 3} {res} .08865907  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res}  .3955277 {space 3} {res} .08867099  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .39553766 {space 3} {res} .08868185  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .39554676 {space 3} {res} .08869174  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .39555507 {space 3} {res} .08870076  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .39556265 {space 3} {res} .08870897  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .39556958 {space 3} {res} .08871646  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res}  .3955759 {space 3} {res} .08872328  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .39558167 {space 3} {res}  .0887295  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .39558693 {space 3} {res} .08873516  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .39559173 {space 3} {res} .08874032  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .39559611 {space 3} {res} .08874503  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .39560011 {space 3} {res} .08874931  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .39560375 {space 3} {res} .08875322  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .39560707 {space 3} {res} .08875678  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res}  .3956101 {space 3} {res} .08876002  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .39561287 {space 3} {res} .08876297  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .39561539 {space 3} {res} .08876566  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .39561768 {space 3} {res} .08876811  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .39561978 {space 3} {res} .08877035  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .39562169 {space 3} {res} .08877239  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}

Cross-validation over alpha (0 .3 .7 1).
{col 10}alpha {c |} lopt*{col 30} Minimum MSPE
{col 4}{hline 12}{c +}{hline 28}
{res}{col 10}0.000{txt}{col 16}{c |}{res}{col 17} 19.353094{col 30} .38491348{txt}{col 42}#
{res}{col 10}0.300{txt}{col 16}{c |}{res}{col 17} 3.9799876{col 30} .39280426
{col 10}0.700{txt}{col 16}{c |}{res}{col 17} 1.3032665{col 30} .39450316
{col 10}1.000{txt}{col 16}{c |}{res}{col 17}   .745777{col 30} .39489417
{txt}* lambda value that minimizes MSPE for a given alpha
# alpha value that minimizes MSPE
Estimate lasso with lambda=64.86388040195374 (lse) and alpha=0.

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}{res}
{txt}__000001[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .71340285 {space 3} {res} .14214945  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .69637518 {space 3} {res} .14412813  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .67076984 {space 3} {res}  .1449169  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .63996718 {space 3} {res} .14131212  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .60309124 {space 3} {res} .13025234  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .57334223 {space 3} {res} .12063003  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .54870604 {space 3} {res} .11225882  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res}  .5283091 {space 3} {res} .10499633  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .51189786 {space 3} {res} .09858616  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .49864049 {space 3} {res} .09304727  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .48785183 {space 3} {res} .08831432  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .47886756 {space 3} {res} .08421944  ^
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .47123454 {space 3} {res} .08069274  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .46482525 {space 3} {res} .07765019  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .45949315 {space 3} {res} .07488712  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res}  .4553709 {space 3} {res} .07249182  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .45206834 {space 3} {res} .07041712  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .44924448 {space 3} {res} .06860866  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .44681803 {space 3} {res} .06710669  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .44428588 {space 3} {res} .06572044  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .44206915 {space 3} {res} .06442177  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .44104723 {space 3} {res} .06320038  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .44158551 {space 3} {res} .06202387  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .44263089 {space 3} {res} .06097784  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .44394391 {space 3} {res} .05989353  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .44501117 {space 3} {res} .05886222  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .44566329 {space 3} {res}  .0579871  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .44623253 {space 3} {res} .05729104  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .44627151 {space 3} {res} .05681538  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .44603486 {space 3} {res} .05652182  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .44396763 {space 3} {res} .05597152  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .44203382 {space 3} {res} .05558459  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res}  .4402499 {space 3} {res} .05522612  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .43877098 {space 3} {res} .05495242  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .43713827 {space 3} {res} .05488726  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .43579659 {space 3} {res} .05486008  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .43470307 {space 3} {res} .05485596  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .43350022 {space 3} {res} .05480932  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .43264763 {space 3} {res} .05481297  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .43187241 {space 3} {res} .05481227  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res}  .4310544 {space 3} {res} .05482569  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .43039819 {space 3} {res} .05484854  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .42984461 {space 3} {res} .05487818  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .42937701 {space 3} {res} .05491234  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .42898151 {space 3} {res} .05494928  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .42864651 {space 3} {res} .05498766  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .42836233 {space 3} {res} .05502648  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .42812089 {space 3} {res}   .055065  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .42786923 {space 3} {res} .05511224  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .42763623 {space 3} {res} .05516046  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .42743398 {space 3} {res} .05520592  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res}  .4273255 {space 3} {res}  .0552349  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .42718638 {space 3} {res} .05527202  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .42706532 {space 3} {res} .05530672  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .42695975 {space 3} {res} .05533907  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .42686749 {space 3} {res} .05536915  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .42678669 {space 3} {res} .05539705  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .42671578 {space 3} {res} .05542288  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .42665341 {space 3} {res} .05544674  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .42659846 {space 3} {res} .05546877  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .42654993 {space 3} {res} .05548907  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .42650701 {space 3} {res} .05550776  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .42646897 {space 3} {res} .05552494  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .42643519 {space 3} {res} .05554072  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .42640515 {space 3} {res} .05555521  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .42637839 {space 3} {res}  .0555685  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .42635452 {space 3} {res} .05558069  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .42633319 {space 3} {res} .05559185  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res}  .4263141 {space 3} {res} .05560207  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res}   .426297 {space 3} {res} .05561143  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .42628166 {space 3} {res} .05561998  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .42626788 {space 3} {res} .05562781  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res}  .4262555 {space 3} {res} .05563497  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .42624435 {space 3} {res}  .0556415  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res}  .4262343 {space 3} {res} .05564748  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .42622525 {space 3} {res} .05565294  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .42621708 {space 3} {res} .05565792  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .42620969 {space 3} {res} .05566247  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .42620302 {space 3} {res} .05566662  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .42619699 {space 3} {res} .05567041  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .42619153 {space 3} {res} .05567387  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .42618659 {space 3} {res} .05567703  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .42618211 {space 3} {res} .05567991  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .42617805 {space 3} {res} .05568254  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .42617437 {space 3} {res} .05568493  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .42617103 {space 3} {res} .05568712  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res}   .426168 {space 3} {res} .05568911  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .42616525 {space 3} {res} .05569093  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .42616275 {space 3} {res} .05569259  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .42616048 {space 3} {res}  .0556941  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .42615842 {space 3} {res} .05569548  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .42615655 {space 3} {res} .05569673  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .42615485 {space 3} {res} .05569788  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res}  .4261533 {space 3} {res} .05569892  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .42615189 {space 3} {res} .05569987  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .42615061 {space 3} {res} .05570074  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .42614944 {space 3} {res} .05570153  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .42614838 {space 3} {res} .05570225  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .42614742 {space 3} {res} .05570291  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .42614654 {space 3} {res}  .0557035  *
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lopt is at the limit of the lambda range.
{txt}Estimate lasso with lambda=23.31086996759306 (lse).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2387964      0.3133772
{txt}{space 10}lweight {c |}{col 21}{res}      0.5044514      0.7280125
{txt}{space 13}lbph {c |}{col 21}{res}      0.0024629      0.0661405
{txt}{space 10}gleason {c |}{col 21}{res}      0.0188429      0.1878900
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.1940679     -2.1878029
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=23.31086996759).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Lasso   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2387964      0.3133772
{txt}{space 10}lweight {c |}{col 21}{res}      0.5044514      0.7280125
{txt}{space 13}lbph {c |}{col 21}{res}      0.0024629      0.0661405
{txt}{space 10}gleason {c |}{col 21}{res}      0.0188429      0.1878900
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.1940679     -2.1878029
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=23.31086996759).
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,5]
        lcavol     lweight        lbph     gleason       _cons
y1 {res}  .23879637   .50445142   .00246288   .01884288  -.19406794
{reset}{res}
{txt}__000001[1,5]
        lcavol     lweight        lbph     gleason       _cons
y1 {res}  .23879637   .50445142   .00246288   .01884288  -.19406794
{reset}K-fold cross-validation with 10 folds. Elastic net with alpha=0.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .41249222 {space 3} {res} .06873871  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .41094272 {space 3} {res} .06873615  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .40964416 {space 3} {res} .06881682  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .40858667 {space 3} {res} .06897897  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .40775893 {space 3} {res} .06921948  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .40714829 {space 3} {res} .06953394  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .40674086 {space 3} {res}  .0699168  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .40652173 {space 3} {res} .07036161  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .40647516 {space 3} {res} .07086121  *
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .40658481 {space 3} {res} .07140798  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .40683403 {space 3} {res} .07199406  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res}  .4072061 {space 3} {res} .07261156  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .40768447 {space 3} {res} .07325277  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .40825302 {space 3} {res} .07391031  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .40889627 {space 3} {res} .07457723  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .40959954 {space 3} {res} .07524718  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res}  .4103491 {space 3} {res} .07591439  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .41113231 {space 3} {res} .07657377  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .41193766 {space 3} {res}  .0772209  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .41275484 {space 3} {res} .07785202  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .41357474 {space 3} {res} .07846403  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .41438943 {space 3} {res} .07905443  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .41519215 {space 3} {res} .07962127  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .41597722 {space 3} {res} .08016313  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .41673998 {space 3} {res} .08067907  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .41747671 {space 3} {res} .08116853  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .41818456 {space 3} {res} .08163131  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .41886144 {space 3} {res} .08206754  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .41950593 {space 3} {res} .08247756  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .42011719 {space 3} {res} .08286195  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .42069489 {space 3} {res} .08322147  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .42123912 {space 3} {res} .08355698  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .42175032 {space 3} {res} .08386945  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .42222923 {space 3} {res} .08415993  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .42267679 {space 3} {res} .08442951  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .42309413 {space 3} {res}  .0846793  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res}  .4234825 {space 3} {res} .08491043  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .42384325 {space 3} {res}   .085124  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .42417778 {space 3} {res} .08532112  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .42448752 {space 3} {res} .08550284  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .42477391 {space 3} {res} .08567022  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .42503836 {space 3} {res} .08582422  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .42528226 {space 3} {res} .08596581  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .42550699 {space 3} {res} .08609588  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .42571383 {space 3} {res} .08621528  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .42590405 {space 3} {res} .08632482  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .42607884 {space 3} {res} .08642525  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .42623933 {space 3} {res} .08651728  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .42638659 {space 3} {res} .08660158  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .42652163 {space 3} {res} .08667875  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .42664539 {space 3} {res} .08674936  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .42675876 {space 3} {res} .08681396  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .42686256 {space 3} {res} .08687303  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .42695756 {space 3} {res} .08692703  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .42704446 {space 3} {res} .08697638  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .42712394 {space 3} {res} .08702147  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .4271966 {space 3} {res} .08706266  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .42726301 {space 3} {res} .08710027  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .42732368 {space 3} {res} .08713461  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .42737911 {space 3} {res} .08716596  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .42742973 {space 3} {res} .08719458  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .42747595 {space 3} {res} .08722069  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .42751814 {space 3} {res} .08724452  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .42755666 {space 3} {res} .08726625  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res}  .4275918 {space 3} {res} .08728608  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .42762388 {space 3} {res} .08730417  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .42765314 {space 3} {res} .08732067  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .42767983 {space 3} {res} .08733572  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .42770418 {space 3} {res} .08734944  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .42772639 {space 3} {res} .08736195  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .42774664 {space 3} {res} .08737336  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .42776511 {space 3} {res} .08738376  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .42778196 {space 3} {res} .08739324  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .42779731 {space 3} {res} .08740188  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .42781131 {space 3} {res} .08740976  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .42782408 {space 3} {res} .08741694  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .42783572 {space 3} {res} .08742349  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .42784632 {space 3} {res} .08742946  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .42785599 {space 3} {res}  .0874349  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .42786481 {space 3} {res} .08743986  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .42787284 {space 3} {res} .08744437  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .42788016 {space 3} {res} .08744849  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .42788684 {space 3} {res} .08745224  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .42789292 {space 3} {res} .08745567  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .42789847 {space 3} {res} .08745878  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .42790352 {space 3} {res} .08746162  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .42790812 {space 3} {res} .08746421  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .42791232 {space 3} {res} .08746657  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .42791614 {space 3} {res} .08746872  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .42791963 {space 3} {res} .08747068  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res}  .4279228 {space 3} {res} .08747246  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res}  .4279257 {space 3} {res} .08747409  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .42792834 {space 3} {res} .08747557  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .42793074 {space 3} {res} .08747692  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .42793293 {space 3} {res} .08747815  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .42793492 {space 3} {res} .08747928  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .42793674 {space 3} {res}  .0874803  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res}  .4279384 {space 3} {res} .08748123  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .42793991 {space 3} {res} .08748208  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .42794129 {space 3} {res} .08748285  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.

{txt}K-fold cross-validation with 10 folds. Square-root LASSO estimator.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .45487026 {space 3} {res} .07285573  ^
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .44531506 {space 3} {res} .07173354  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .43725375 {space 3} {res} .07079782  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .43052671 {space 3} {res}  .0700358  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .42502983 {space 3} {res} .06945875  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .42028772 {space 3} {res} .06887885  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .41654013 {space 3} {res} .06846463  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .41353262 {space 3} {res} .06813845  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .41117742 {space 3} {res} .06789759  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .41037273 {space 3} {res} .06797973  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res}  .4102885 {space 3} {res} .06815927  *
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .41070256 {space 3} {res} .06831828  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res}  .4114802 {space 3} {res} .06867087  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .41261231 {space 3} {res} .06908631  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .41435453 {space 3} {res} .06960059  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .41631892 {space 3} {res} .07017452  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .41817868 {space 3} {res} .07080074  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .42002555 {space 3} {res} .07148731  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .42191437 {space 3} {res} .07221831  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .42366243 {space 3} {res} .07308224  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .42499876 {space 3} {res} .07391974  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .42634062 {space 3} {res} .07476522  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .42714388 {space 3} {res} .07544326  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .42715626 {space 3} {res} .07604686  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .42688454 {space 3} {res} .07666404  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .42674222 {space 3} {res} .07727332  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .42663282 {space 3} {res} .07789734  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .42655601 {space 3} {res}  .0785224  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .42651488 {space 3} {res}  .0791234  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .42651635 {space 3} {res} .07969702  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .42656415 {space 3} {res} .08024052  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res}  .4266511 {space 3} {res} .08075285  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res}  .4267673 {space 3} {res} .08123403  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .42690462 {space 3} {res} .08168448  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .42705644 {space 3} {res} .08210498  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .42721738 {space 3} {res} .08249653  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .42738315 {space 3} {res} .08286034  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .42749778 {space 3} {res} .08320951  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .42746784 {space 3} {res} .08356578  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .42745195 {space 3} {res} .08389443  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .42744706 {space 3} {res} .08419724  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .42745068 {space 3} {res} .08447596  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .42746076 {space 3} {res} .08473225  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .42747564 {space 3} {res} .08496771  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .42749398 {space 3} {res} .08518387  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .4275147 {space 3} {res} .08538218  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .42753692 {space 3} {res} .08556398  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .42755998 {space 3} {res} .08573057  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .42758333 {space 3} {res} .08588313  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .42760656 {space 3} {res} .08602278  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .42762937 {space 3} {res} .08615056  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .42765152 {space 3} {res} .08626744  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .42767284 {space 3} {res}  .0863743  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .42769322 {space 3} {res} .08647197  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .42771257 {space 3} {res} .08656123  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .42773087 {space 3} {res} .08664277  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res}  .4277481 {space 3} {res} .08671724  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .42776425 {space 3} {res} .08678524  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .42777934 {space 3} {res} .08684732  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .42779342 {space 3} {res} .08690399  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .42780651 {space 3} {res}  .0869557  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .42781865 {space 3} {res}  .0870029  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res}  .4278299 {space 3} {res} .08704595  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res}  .4278403 {space 3} {res} .08708524  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res}  .4278499 {space 3} {res} .08712107  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .42785876 {space 3} {res} .08715375  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .42786691 {space 3} {res} .08718356  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .42787442 {space 3} {res} .08721074  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .42788132 {space 3} {res} .08723552  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .42788765 {space 3} {res} .08725812  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .42789347 {space 3} {res} .08727873  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res}  .4278988 {space 3} {res} .08729751  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .42790369 {space 3} {res} .08731464  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .42790816 {space 3} {res} .08733025  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .42791226 {space 3} {res} .08734448  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .42791601 {space 3} {res} .08735745  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .42791945 {space 3} {res} .08736927  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .42792258 {space 3} {res} .08738005  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .42792545 {space 3} {res} .08738987  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .42792808 {space 3} {res} .08739883  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .42793047 {space 3} {res} .08740699  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .42793266 {space 3} {res} .08741442  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .42793466 {space 3} {res}  .0874212  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .42793648 {space 3} {res} .08742737  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .42793815 {space 3} {res}   .087433  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .42793967 {space 3} {res} .08743813  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .42794106 {space 3} {res} .08744281  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .42794232 {space 3} {res} .08744707  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .42794348 {space 3} {res} .08745095  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .42794453 {space 3} {res} .08745448  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .42794549 {space 3} {res} .08745771  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .42794637 {space 3} {res} .08746064  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .42794717 {space 3} {res} .08746332  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res}  .4279479 {space 3} {res} .08746576  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .42794856 {space 3} {res} .08746798  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .42794917 {space 3} {res} .08747001  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .42794972 {space 3} {res} .08747185  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .42795022 {space 3} {res} .08747353  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .42795068 {space 3} {res} .08747507  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res}  .4279511 {space 3} {res} .08747646  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{err}Warning: lse is at the limit of the lambda range.

{txt}K-fold cross-validation with 10 folds. Square-root LASSO estimator.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .57967319 {space 3} {res} .08915346  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .54969436 {space 3} {res} .08433393  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .52605656 {space 3} {res} .08045158  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .50749237 {space 3} {res} .07761858  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .49297613 {space 3} {res} .07535408  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .48118909 {space 3} {res} .07358711  ^
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .47117375 {space 3} {res}  .0723607  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res} .46212837 {space 3} {res} .07180982  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .45452519 {space 3} {res} .07150961  
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res} .44638135 {space 3} {res} .07103402  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .43945535 {space 3} {res} .07067977  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .43384987 {space 3} {res}  .0704269  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res}  .4293392 {space 3} {res} .07025122  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .42573351 {space 3} {res} .07013489  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .42260706 {space 3} {res} .06994568  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res}  .4199643 {space 3} {res} .06974838  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .41764523 {space 3} {res}  .0695399  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .41697177 {space 3} {res} .06959889  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .41695758 {space 3} {res} .06978407  *
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .41750523 {space 3} {res} .07001081  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .41823841 {space 3} {res} .07042248  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .41984454 {space 3} {res} .07096905  
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .42168921 {space 3} {res}    .07148  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .42410183 {space 3} {res}  .0722018  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .42625684 {space 3} {res} .07289835  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .42823288 {space 3} {res} .07362413  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .42988191 {space 3} {res} .07448702  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .43140093 {space 3} {res} .07535672  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .43264709 {space 3} {res} .07619689  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .43387688 {space 3} {res} .07695779  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .43379948 {space 3} {res} .07753478  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .43315886 {space 3} {res} .07813411  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .43245988 {space 3} {res}  .0786919  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res}  .4319965 {space 3} {res} .07923896  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .43164834 {space 3} {res} .07976117  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .43138522 {space 3} {res} .08025952  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .43107845 {space 3} {res} .08077715  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .43084403 {space 3} {res} .08126096  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res} .43066813 {space 3} {res}  .0817117  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .43053932 {space 3} {res} .08213051  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .43037352 {space 3} {res} .08252902  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .43025285 {space 3} {res} .08289698  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .43015572 {space 3} {res} .08323797  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .43008289 {space 3} {res} .08355265  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .43002959 {space 3} {res} .08384266  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res}  .4299656 {space 3} {res} .08411544  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .42973281 {space 3} {res} .08440697  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res} .42952981 {space 3} {res} .08467409  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .42935242 {space 3} {res} .08491869  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res}  .4291971 {space 3} {res} .08514257  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .42906083 {space 3} {res} .08534737  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .42894104 {space 3} {res} .08553465  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .42883553 {space 3} {res} .08570584  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res} .42874243 {space 3} {res} .08586228  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .42866011 {space 3} {res} .08600519  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res}  .4285872 {space 3} {res} .08613572  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .42852251 {space 3} {res}  .0862549  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .42846501 {space 3} {res}  .0863637  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .42841382 {space 3} {res}   .086463  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .42836819 {space 3} {res} .08655363  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res} .42832743 {space 3} {res} .08663632  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .42829099 {space 3} {res} .08671177  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .42825836 {space 3} {res} .08678059  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .42822911 {space 3} {res} .08684336  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .42820285 {space 3} {res} .08690061  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .42817925 {space 3} {res} .08695282  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .42815803 {space 3} {res} .08700043  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .42813891 {space 3} {res} .08704384  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .42812168 {space 3} {res} .08708342  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .42810614 {space 3} {res} .08711951  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .42809212 {space 3} {res} .08715241  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .42807944 {space 3} {res}  .0871824  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res} .42806798 {space 3} {res} .08720973  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .42805762 {space 3} {res} .08723465  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .42804823 {space 3} {res} .08725737  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .42803973 {space 3} {res} .08727807  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .42803203 {space 3} {res} .08729694  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .42802505 {space 3} {res} .08731414  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .42801872 {space 3} {res} .08732981  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .42801298 {space 3} {res} .08734409  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .42800776 {space 3} {res} .08735711  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .42800303 {space 3} {res} .08736898  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .42799873 {space 3} {res} .08737979  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .42799482 {space 3} {res} .08738964  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .42799127 {space 3} {res} .08739862  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .42798805 {space 3} {res}  .0874068  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .42798511 {space 3} {res} .08741426  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .42798245 {space 3} {res} .08742105  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .42798002 {space 3} {res} .08742724  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .42797782 {space 3} {res} .08743289  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res} .42797581 {space 3} {res} .08743803  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .42797398 {space 3} {res} .08744271  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .42797232 {space 3} {res} .08744698  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .42797081 {space 3} {res} .08745087  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .42796943 {space 3} {res} .08745442  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .42796818 {space 3} {res} .08745765  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .42796704 {space 3} {res} .08746059  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res}   .427966 {space 3} {res} .08746327  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .42796506 {space 3} {res} .08746572  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res}  .4279642 {space 3} {res} .08746794  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}

K-fold cross-validation with 10 folds. Square-root LASSO estimator.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res}  64.86388 {space 3} {res} .69520818 {space 3} {res} .10390106  
{txt}         2{c |} {space 3} {res} 59.101552 {space 3} {res} .67833049 {space 3} {res} .10473425  
{txt}         3{c |} {space 3} {res} 53.851133 {space 3} {res} .64404711 {space 3} {res} .09974933  
{txt}         4{c |} {space 3} {res} 49.067147 {space 3} {res} .60028142 {space 3} {res} .09244152  
{txt}         5{c |} {space 3} {res} 44.708157 {space 3} {res} .56404987 {space 3} {res}  .0864637  
{txt}         6{c |} {space 3} {res} 40.736407 {space 3} {res} .53407354 {space 3} {res} .08164142  
{txt}         7{c |} {space 3} {res} 37.117497 {space 3} {res} .51029703 {space 3} {res}  .0777082  
{txt}         8{c |} {space 3} {res} 33.820081 {space 3} {res}  .4930277 {space 3} {res} .07521835  
{txt}         9{c |} {space 3} {res} 30.815598 {space 3} {res} .47968048 {space 3} {res} .07339067  ^
{txt}        10{c |} {space 3} {res} 28.078025 {space 3} {res}  .4698501 {space 3} {res} .07203684  
{txt}        11{c |} {space 3} {res} 25.583651 {space 3} {res} .46198969 {space 3} {res} .07114719  
{txt}        12{c |} {space 3} {res}  23.31087 {space 3} {res} .45529806 {space 3} {res} .07077259  
{txt}        13{c |} {space 3} {res} 21.239997 {space 3} {res} .44944934 {space 3} {res}  .0707546  
{txt}        14{c |} {space 3} {res} 19.353094 {space 3} {res} .44474504 {space 3} {res} .07080495  
{txt}        15{c |} {space 3} {res} 17.633818 {space 3} {res} .43884618 {space 3} {res} .07054382  
{txt}        16{c |} {space 3} {res} 16.067278 {space 3} {res} .43367703 {space 3} {res} .07041637  
{txt}        17{c |} {space 3} {res} 14.639906 {space 3} {res} .42953661 {space 3} {res} .07033926  
{txt}        18{c |} {space 3} {res} 13.339337 {space 3} {res} .42623683 {space 3} {res} .07029925  
{txt}        19{c |} {space 3} {res} 12.154307 {space 3} {res} .42362274 {space 3} {res} .07028688  
{txt}        20{c |} {space 3} {res} 11.074552 {space 3} {res} .42156677 {space 3} {res} .07029525  
{txt}        21{c |} {space 3} {res} 10.090719 {space 3} {res} .42024022 {space 3} {res} .07028316  
{txt}        22{c |} {space 3} {res} 9.1942875 {space 3} {res} .42002459 {space 3} {res} .07046627  *
{txt}        23{c |} {space 3} {res} 8.3774923 {space 3} {res} .42013846 {space 3} {res} .07060196  
{txt}        24{c |} {space 3} {res}  7.633259 {space 3} {res} .42062262 {space 3} {res} .07088929  
{txt}        25{c |} {space 3} {res} 6.9551413 {space 3} {res} .42147611 {space 3} {res} .07132332  
{txt}        26{c |} {space 3} {res} 6.3372657 {space 3} {res} .42335753 {space 3} {res} .07181442  
{txt}        27{c |} {space 3} {res} 5.7742805 {space 3} {res} .42562893 {space 3} {res} .07249202  
{txt}        28{c |} {space 3} {res} 5.2613093 {space 3} {res} .42796079 {space 3} {res} .07318669  
{txt}        29{c |} {space 3} {res} 4.7939091 {space 3} {res} .42979725 {space 3} {res}  .0739369  
{txt}        30{c |} {space 3} {res} 4.3680314 {space 3} {res} .43161315 {space 3} {res} .07472471  
{txt}        31{c |} {space 3} {res} 3.9799876 {space 3} {res} .43312564 {space 3} {res} .07560666  
{txt}        32{c |} {space 3} {res} 3.6264164 {space 3} {res} .43433876 {space 3} {res} .07645508  
{txt}        33{c |} {space 3} {res} 3.3042556 {space 3} {res} .43548881 {space 3} {res} .07725915  
{txt}        34{c |} {space 3} {res} 3.0107146 {space 3} {res} .43607889 {space 3} {res} .07787089  
{txt}        35{c |} {space 3} {res}  2.743251 {space 3} {res} .43525632 {space 3} {res} .07842885  
{txt}        36{c |} {space 3} {res} 2.4995482 {space 3} {res} .43452834 {space 3} {res} .07899458  
{txt}        37{c |} {space 3} {res} 2.2774952 {space 3} {res} .43386236 {space 3} {res} .07952805  
{txt}        38{c |} {space 3} {res} 2.0751688 {space 3} {res} .43333976 {space 3} {res} .08003696  
{txt}        39{c |} {space 3} {res} 1.8908165 {space 3} {res}  .4329288 {space 3} {res} .08051851  
{txt}        40{c |} {space 3} {res} 1.7228416 {space 3} {res} .43259505 {space 3} {res} .08097706  
{txt}        41{c |} {space 3} {res} 1.5697891 {space 3} {res} .43222257 {space 3} {res} .08145178  
{txt}        42{c |} {space 3} {res} 1.4303334 {space 3} {res} .43192221 {space 3} {res} .08189302  
{txt}        43{c |} {space 3} {res} 1.3032665 {space 3} {res} .43168093 {space 3} {res} .08230208  
{txt}        44{c |} {space 3} {res} 1.1874879 {space 3} {res} .43148798 {space 3} {res} .08268049  
{txt}        45{c |} {space 3} {res} 1.0819947 {space 3} {res} .43128452 {space 3} {res}   .083037  
{txt}        46{c |} {space 3} {res} .98587331 {space 3} {res} .43109787 {space 3} {res} .08336887  
{txt}        47{c |} {space 3} {res} .89829104 {space 3} {res} .43094017 {space 3} {res} .08367521  
{txt}        48{c |} {space 3} {res} .81848934 {space 3} {res}  .4308099 {space 3} {res}  .0839571  
{txt}        49{c |} {space 3} {res}   .745777 {space 3} {res} .43070235 {space 3} {res} .08421621  
{txt}        50{c |} {space 3} {res} .67952423 {space 3} {res} .43050136 {space 3} {res} .08447899  
{txt}        51{c |} {space 3} {res} .61915717 {space 3} {res} .43022661 {space 3} {res} .08474196  
{txt}        52{c |} {space 3} {res} .56415295 {space 3} {res} .42998451 {space 3} {res} .08498242  
{txt}        53{c |} {space 3} {res} .51403516 {space 3} {res} .42977077 {space 3} {res} .08520221  
{txt}        54{c |} {space 3} {res} .46836969 {space 3} {res}  .4295817 {space 3} {res} .08540304  
{txt}        55{c |} {space 3} {res} .42676102 {space 3} {res} .42941414 {space 3} {res} .08558647  
{txt}        56{c |} {space 3} {res} .38884875 {space 3} {res} .42926539 {space 3} {res} .08575398  
{txt}        57{c |} {space 3} {res}  .3543045 {space 3} {res} .42913311 {space 3} {res} .08590691  
{txt}        58{c |} {space 3} {res} .32282906 {space 3} {res} .42901528 {space 3} {res} .08604649  
{txt}        59{c |} {space 3} {res} .29414982 {space 3} {res} .42891016 {space 3} {res} .08617388  
{txt}        60{c |} {space 3} {res} .26801836 {space 3} {res} .42881624 {space 3} {res} .08629011  
{txt}        61{c |} {space 3} {res} .24420835 {space 3} {res}  .4287322 {space 3} {res} .08639616  
{txt}        62{c |} {space 3} {res} .22251355 {space 3} {res} .42865692 {space 3} {res} .08649289  
{txt}        63{c |} {space 3} {res} .20274606 {space 3} {res} .42858939 {space 3} {res} .08658111  
{txt}        64{c |} {space 3} {res} .18473466 {space 3} {res} .42852874 {space 3} {res} .08666158  
{txt}        65{c |} {space 3} {res} .16832334 {space 3} {res} .42847422 {space 3} {res} .08673496  
{txt}        66{c |} {space 3} {res} .15336996 {space 3} {res} .42842515 {space 3} {res} .08680186  
{txt}        67{c |} {space 3} {res} .13974499 {space 3} {res} .42838094 {space 3} {res} .08686287  
{txt}        68{c |} {space 3} {res} .12733043 {space 3} {res} .42834108 {space 3} {res} .08691849  
{txt}        69{c |} {space 3} {res} .11601875 {space 3} {res} .42830512 {space 3} {res}  .0869692  
{txt}        70{c |} {space 3} {res} .10571196 {space 3} {res} .42827263 {space 3} {res} .08701542  
{txt}        71{c |} {space 3} {res}  .0963208 {space 3} {res} .42824328 {space 3} {res} .08705756  
{txt}        72{c |} {space 3} {res} .08776393 {space 3} {res} .42821673 {space 3} {res} .08709597  
{txt}        73{c |} {space 3} {res} .07996722 {space 3} {res}  .4281927 {space 3} {res} .08713098  
{txt}        74{c |} {space 3} {res} .07286316 {space 3} {res} .42817095 {space 3} {res} .08716289  
{txt}        75{c |} {space 3} {res} .06639019 {space 3} {res} .42815124 {space 3} {res} .08719198  
{txt}        76{c |} {space 3} {res} .06049227 {space 3} {res} .42813338 {space 3} {res} .08721849  
{txt}        77{c |} {space 3} {res} .05511831 {space 3} {res} .42811718 {space 3} {res} .08724265  
{txt}        78{c |} {space 3} {res} .05022175 {space 3} {res} .42810249 {space 3} {res} .08726467  
{txt}        79{c |} {space 3} {res} .04576019 {space 3} {res} .42808916 {space 3} {res} .08728474  
{txt}        80{c |} {space 3} {res} .04169498 {space 3} {res} .42807706 {space 3} {res} .08730302  
{txt}        81{c |} {space 3} {res} .03799091 {space 3} {res} .42806607 {space 3} {res} .08731969  
{txt}        82{c |} {space 3} {res}  .0346159 {space 3} {res} .42805608 {space 3} {res} .08733488  
{txt}        83{c |} {space 3} {res} .03154072 {space 3} {res} .42804701 {space 3} {res} .08734872  
{txt}        84{c |} {space 3} {res} .02873873 {space 3} {res} .42803877 {space 3} {res} .08736133  
{txt}        85{c |} {space 3} {res} .02618566 {space 3} {res} .42803128 {space 3} {res} .08737282  
{txt}        86{c |} {space 3} {res}  .0238594 {space 3} {res} .42802446 {space 3} {res}  .0873833  
{txt}        87{c |} {space 3} {res}  .0217398 {space 3} {res} .42801827 {space 3} {res} .08739284  
{txt}        88{c |} {space 3} {res} .01980849 {space 3} {res} .42801263 {space 3} {res} .08740154  
{txt}        89{c |} {space 3} {res} .01804876 {space 3} {res} .42800751 {space 3} {res} .08740946  
{txt}        90{c |} {space 3} {res} .01644536 {space 3} {res} .42800285 {space 3} {res} .08741669  
{txt}        91{c |} {space 3} {res}  .0149844 {space 3} {res}  .4279986 {space 3} {res} .08742327  
{txt}        92{c |} {space 3} {res} .01365323 {space 3} {res} .42799474 {space 3} {res} .08742926  
{txt}        93{c |} {space 3} {res} .01244031 {space 3} {res} .42799123 {space 3} {res} .08743473  
{txt}        94{c |} {space 3} {res} .01133515 {space 3} {res} .42798803 {space 3} {res} .08743971  
{txt}        95{c |} {space 3} {res} .01032816 {space 3} {res} .42798512 {space 3} {res} .08744424  
{txt}        96{c |} {space 3} {res} .00941064 {space 3} {res} .42798247 {space 3} {res} .08744838  
{txt}        97{c |} {space 3} {res} .00857462 {space 3} {res} .42798005 {space 3} {res} .08745214  
{txt}        98{c |} {space 3} {res} .00781288 {space 3} {res} .42797785 {space 3} {res} .08745557  
{txt}        99{c |} {space 3} {res}  .0071188 {space 3} {res} .42797585 {space 3} {res}  .0874587  
{txt}       100{c |} {space 3} {res} .00648639 {space 3} {res} .42797403 {space 3} {res} .08746155  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}

Cross-validation over alpha (0 .3 .7 1).
{col 10}alpha {c |} lopt*{col 30} Minimum MSPE
{col 4}{hline 12}{c +}{hline 28}
{res}{col 10}0.000{txt}{col 16}{c |}{res}{col 17} 30.815598{col 30} .40647516{txt}{col 42}#
{res}{col 10}0.300{txt}{col 16}{c |}{res}{col 17} 25.583651{col 30}  .4102885
{col 10}0.700{txt}{col 16}{c |}{res}{col 17} 12.154307{col 30} .41695758
{col 10}1.000{txt}{col 16}{c |}{res}{col 17} 9.1942875{col 30} .42002459
{txt}* lambda value that minimizes MSPE for a given alpha
# alpha value that minimizes MSPE
Estimate lasso with lambda=64.86388040195374 (lse) and alpha=0.

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).

{hline 18}{c TT}{hline 32}
{col 10}Selected {c |}           Ridge   Post-est OLS
{hline 18}{c +}{hline 32}
{space 11}lcavol {c |}{col 21}{res}      0.2321985      0.3897536
{txt}{space 10}lweight {c |}{col 21}{res}      0.5274469      0.7911376
{txt}{space 14}age {c |}{col 21}{res}     -0.0052194     -0.0203522
{txt}{space 13}lbph {c |}{col 21}{res}      0.0804794      0.1026400
{txt}{space 14}svi {c |}{col 21}{res}     -0.1159764     -0.2764415
{txt}{space 14}lcp {c |}{col 21}{res}      0.0018973     -0.0959183
{txt}{space 10}gleason {c |}{col 21}{res}      0.1439188      0.2326491
{txt}{space 12}pgg45 {c |}{col 21}{res}      0.0020957      0.0026209
{txt}{hline 18}{c +}{hline 32}
{col 4}Partialled-out{help lasso2##examples_partialling:*}{c |}
{hline 18}{c +}{hline 32}
{space 12}_cons {c |}{col 21}{res}     -0.8073752     -1.5876684
{txt}{hline 18}{c BT}{hline 32}
Use e(b) from previous lasso2 estimation (lambda=64.86388040195).
mreldif=0. tolerance = .01
{res}
{txt}__000000[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}{res}
{txt}__000001[1,9]
        lcavol     lweight         age        lbph         svi         lcp
y1 {res}  .23219855    .5274469  -.00521937   .08047941  -.11597644    .0018973

{txt}       gleason       pgg45       _cons
y1 {res}  .14391884    .0020957  -.80737524
{reset}r; t=6.38 12:41:36

{com}. *
. 
. ********************************************************************************
. *** partial                                                                                      ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:41:36

{com}. 
. cvlasso $model, partial(svi) saveest(m)
{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 113.54767 {space 3} {res} .91771633 {space 3} {res} .16834785  
{txt}         2{c |} {space 3} {res} 103.46041 {space 3} {res} .89512724 {space 3} {res} .17208465  
{txt}         3{c |} {space 3} {res} 94.269272 {space 3} {res} .84826691 {space 3} {res} .16100287  
{txt}         4{c |} {space 3} {res} 85.894649 {space 3} {res} .80618841 {space 3} {res} .14926766  
{txt}         5{c |} {space 3} {res} 78.264005 {space 3} {res} .77126748 {space 3} {res} .13890523  
{txt}         6{c |} {space 3} {res} 71.311247 {space 3} {res} .74331827 {space 3} {res} .12963269  
{txt}         7{c |} {space 3} {res} 64.976152 {space 3} {res} .71890654 {space 3} {res} .12107132  
{txt}         8{c |} {space 3} {res}  59.20385 {space 3} {res} .69457427 {space 3} {res} .11210193  
{txt}         9{c |} {space 3} {res} 53.944343 {space 3} {res}   .669924 {space 3} {res} .10393529  
{txt}        10{c |} {space 3} {res} 49.152076 {space 3} {res} .64730571 {space 3} {res}  .0973695  
{txt}        11{c |} {space 3} {res} 44.785541 {space 3} {res} .62862528 {space 3} {res} .09180712  
{txt}        12{c |} {space 3} {res} 40.806917 {space 3} {res} .61374488 {space 3} {res} .08707667  ^
{txt}        13{c |} {space 3} {res} 37.181743 {space 3} {res}  .6016873 {space 3} {res} .08309864  
{txt}        14{c |} {space 3} {res}  33.87862 {space 3} {res} .59238433 {space 3} {res} .07968669  
{txt}        15{c |} {space 3} {res} 30.868936 {space 3} {res} .58492016 {space 3} {res} .07677271  
{txt}        16{c |} {space 3} {res} 28.126625 {space 3} {res} .57889269 {space 3} {res} .07432082  
{txt}        17{c |} {space 3} {res} 25.627933 {space 3} {res} .57377169 {space 3} {res} .07243419  
{txt}        18{c |} {space 3} {res} 23.351218 {space 3} {res} .57022539 {space 3} {res} .07088703  
{txt}        19{c |} {space 3} {res}  21.27676 {space 3} {res} .56748827 {space 3} {res}  .0696236  
{txt}        20{c |} {space 3} {res} 19.386592 {space 3} {res} .56519051 {space 3} {res} .06855432  
{txt}        21{c |} {space 3} {res}  17.66434 {space 3} {res} .56353776 {space 3} {res} .06766887  
{txt}        22{c |} {space 3} {res} 16.095089 {space 3} {res}  .5626541 {space 3} {res} .06692972  
{txt}        23{c |} {space 3} {res} 14.665246 {space 3} {res} .56275391 {space 3} {res} .06648112  
{txt}        24{c |} {space 3} {res} 13.362426 {space 3} {res}  .5631844 {space 3} {res} .06622298  
{txt}        25{c |} {space 3} {res} 12.175345 {space 3} {res} .56372536 {space 3} {res} .06595517  
{txt}        26{c |} {space 3} {res} 11.093721 {space 3} {res} .56337267 {space 3} {res} .06557214  
{txt}        27{c |} {space 3} {res} 10.108185 {space 3} {res} .56155215 {space 3} {res} .06557609  
{txt}        28{c |} {space 3} {res} 9.2102017 {space 3} {res} .55929877 {space 3} {res} .06600608  
{txt}        29{c |} {space 3} {res} 8.3919928 {space 3} {res} .55710114 {space 3} {res}  .0664416  
{txt}        30{c |} {space 3} {res} 7.6464713 {space 3} {res} .55547497 {space 3} {res} .06690399  
{txt}        31{c |} {space 3} {res} 6.9671798 {space 3} {res} .55439209 {space 3} {res} .06739902  
{txt}        32{c |} {space 3} {res} 6.3482348 {space 3} {res} .55362971 {space 3} {res} .06789477  
{txt}        33{c |} {space 3} {res} 5.7842751 {space 3} {res} .55276324 {space 3} {res} .06849813  
{txt}        34{c |} {space 3} {res}  5.270416 {space 3} {res} .55196896 {space 3} {res} .06901074  
{txt}        35{c |} {space 3} {res} 4.8022068 {space 3} {res} .55142395 {space 3} {res}  .0694636  
{txt}        36{c |} {space 3} {res}  4.375592 {space 3} {res} .55107574 {space 3} {res} .06986428  
{txt}        37{c |} {space 3} {res} 3.9868765 {space 3} {res} .55088164 {space 3} {res} .07021935  
{txt}        38{c |} {space 3} {res} 3.6326933 {space 3} {res} .55074008 {space 3} {res} .07051581  
{txt}        39{c |} {space 3} {res} 3.3099749 {space 3} {res} .55026787 {space 3} {res} .07066549  
{txt}        40{c |} {space 3} {res} 3.0159258 {space 3} {res} .54994838 {space 3} {res}  .0708167  
{txt}        41{c |} {space 3} {res} 2.7479993 {space 3} {res} .54970557 {space 3} {res} .07095853  
{txt}        42{c |} {space 3} {res} 2.5038746 {space 3} {res} .54932132 {space 3} {res} .07100815  
{txt}        43{c |} {space 3} {res} 2.2814373 {space 3} {res} .54889289 {space 3} {res} .07100769  
{txt}        44{c |} {space 3} {res} 2.0787607 {space 3} {res} .54854035 {space 3} {res} .07100824  
{txt}        45{c |} {space 3} {res} 1.8940893 {space 3} {res} .54825054 {space 3} {res} .07100949  
{txt}        46{c |} {space 3} {res} 1.7258236 {space 3} {res} .54801256 {space 3} {res} .07101123  
{txt}        47{c |} {space 3} {res} 1.5725062 {space 3} {res} .54787736 {space 3} {res} .07104204  
{txt}        48{c |} {space 3} {res} 1.4328091 {space 3} {res} .54786283 {space 3} {res} .07111427  *
{txt}        49{c |} {space 3} {res} 1.3055223 {space 3} {res} .54786575 {space 3} {res} .07118136  
{txt}        50{c |} {space 3} {res} 1.1895433 {space 3} {res} .54788182 {space 3} {res} .07124354  
{txt}        51{c |} {space 3} {res} 1.0838675 {space 3} {res}  .5479076 {space 3} {res} .07130106  
{txt}        52{c |} {space 3} {res} .98757974 {space 3} {res} .54797725 {space 3} {res} .07134444  
{txt}        53{c |} {space 3} {res} .89984588 {space 3} {res} .54808553 {space 3} {res} .07137485  
{txt}        54{c |} {space 3} {res} .81990605 {space 3} {res} .54819032 {space 3} {res} .07140322  
{txt}        55{c |} {space 3} {res} .74706786 {space 3} {res} .54829089 {space 3} {res} .07142962  
{txt}        56{c |} {space 3} {res} .68070041 {space 3} {res} .54838674 {space 3} {res} .07145414  
{txt}        57{c |} {space 3} {res} .62022886 {space 3} {res} .54847759 {space 3} {res} .07147686  
{txt}        58{c |} {space 3} {res} .56512944 {space 3} {res} .54856328 {space 3} {res} .07149787  
{txt}        59{c |} {space 3} {res} .51492489 {space 3} {res} .54864378 {space 3} {res} .07151728  
{txt}        60{c |} {space 3} {res} .46918039 {space 3} {res} .54871913 {space 3} {res} .07153518  
{txt}        61{c |} {space 3} {res} .42749969 {space 3} {res} .54878945 {space 3} {res} .07155167  
{txt}        62{c |} {space 3} {res}  .3895218 {space 3} {res} .54885491 {space 3} {res} .07156684  
{txt}        63{c |} {space 3} {res} .35491776 {space 3} {res}  .5489157 {space 3} {res} .07158078  
{txt}        64{c |} {space 3} {res} .32338784 {space 3} {res} .54897205 {space 3} {res} .07159359  
{txt}        65{c |} {space 3} {res} .29465896 {space 3} {res} .54902418 {space 3} {res} .07160535  
{txt}        66{c |} {space 3} {res} .26848227 {space 3} {res} .54907233 {space 3} {res} .07161613  
{txt}        67{c |} {space 3} {res} .24463104 {space 3} {res} .54911676 {space 3} {res} .07162601  
{txt}        68{c |} {space 3} {res} .22289869 {space 3} {res} .54915769 {space 3} {res} .07163506  
{txt}        69{c |} {space 3} {res} .20309699 {space 3} {res} .54919536 {space 3} {res} .07164335  
{txt}        70{c |} {space 3} {res} .18505441 {space 3} {res}    .54923 {space 3} {res} .07165093  
{txt}        71{c |} {space 3} {res} .16861469 {space 3} {res} .54926181 {space 3} {res} .07165787  
{txt}        72{c |} {space 3} {res} .15363542 {space 3} {res} .54929102 {space 3} {res} .07166421  
{txt}        73{c |} {space 3} {res} .13998688 {space 3} {res} .54931781 {space 3} {res} .07167001  
{txt}        74{c |} {space 3} {res} .12755083 {space 3} {res} .54934237 {space 3} {res} .07167531  
{txt}        75{c |} {space 3} {res} .11621956 {space 3} {res} .54936487 {space 3} {res} .07168015  
{txt}        76{c |} {space 3} {res} .10589494 {space 3} {res} .54938548 {space 3} {res} .07168457  
{txt}        77{c |} {space 3} {res} .09648752 {space 3} {res} .54940434 {space 3} {res} .07168861  
{txt}        78{c |} {space 3} {res} .08791584 {space 3} {res} .54942159 {space 3} {res}  .0716923  
{txt}        79{c |} {space 3} {res} .08010564 {space 3} {res} .54943737 {space 3} {res} .07169566  
{txt}        80{c |} {space 3} {res} .07298927 {space 3} {res} .54945179 {space 3} {res} .07169874  
{txt}        81{c |} {space 3} {res} .06650511 {space 3} {res} .54946498 {space 3} {res} .07170154  
{txt}        82{c |} {space 3} {res} .06059698 {space 3} {res} .54947703 {space 3} {res}  .0717041  
{txt}        83{c |} {space 3} {res} .05521371 {space 3} {res} .54948803 {space 3} {res} .07170643  
{txt}        84{c |} {space 3} {res} .05030867 {space 3} {res} .54949808 {space 3} {res} .07170856  
{txt}        85{c |} {space 3} {res} .04583939 {space 3} {res} .54950726 {space 3} {res}  .0717105  
{txt}        86{c |} {space 3} {res} .04176715 {space 3} {res} .54951563 {space 3} {res} .07171227  
{txt}        87{c |} {space 3} {res} .03805667 {space 3} {res} .54952328 {space 3} {res} .07171389  
{txt}        88{c |} {space 3} {res} .03467582 {space 3} {res} .54953026 {space 3} {res} .07171536  
{txt}        89{c |} {space 3} {res} .03159531 {space 3} {res} .54953662 {space 3} {res}  .0717167  
{txt}        90{c |} {space 3} {res} .02878847 {space 3} {res} .54954243 {space 3} {res} .07171793  
{txt}        91{c |} {space 3} {res} .02623098 {space 3} {res} .54954773 {space 3} {res} .07171904  
{txt}        92{c |} {space 3} {res}  .0239007 {space 3} {res} .54955257 {space 3} {res} .07172006  
{txt}        93{c |} {space 3} {res} .02177742 {space 3} {res} .54955697 {space 3} {res} .07172099  
{txt}        94{c |} {space 3} {res} .01984278 {space 3} {res}   .549561 {space 3} {res} .07172183  
{txt}        95{c |} {space 3} {res}    .01808 {space 3} {res} .54956466 {space 3} {res}  .0717226  
{txt}        96{c |} {space 3} {res} .01647382 {space 3} {res}   .549568 {space 3} {res} .07172331  
{txt}        97{c |} {space 3} {res} .01501033 {space 3} {res} .54957105 {space 3} {res} .07172395  
{txt}        98{c |} {space 3} {res} .01367686 {space 3} {res} .54957383 {space 3} {res} .07172453  
{txt}        99{c |} {space 3} {res} .01246184 {space 3} {res} .54957637 {space 3} {res} .07172506  
{txt}       100{c |} {space 3} {res} .01135477 {space 3} {res} .54957867 {space 3} {res} .07172555  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=1.44 12:41:38

{com}. 
. // make sure that partial works
. estimates restore m1
{txt}(results {stata estimates replay m1:m1} are active now)
r; t=0.01 12:41:38

{com}. assert "`e(partial)'"=="svi"
{txt}r; t=0.00 12:41:38

{com}. 
. ********************************************************************************
. *** plotting                                                                                             ***
. ********************************************************************************
. 
. * load example data
. insheet using "$prostate", tab clear
{txt}(11 vars, 97 obs)
r; t=0.00 12:41:38

{com}. 
. cvlasso $model, plotcv
{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 163.62492 {space 3} {res} 1.3366576 {space 3} {res} .16829559  
{txt}         2{c |} {space 3} {res} 149.08894 {space 3} {res}  1.240766 {space 3} {res} .16320301  
{txt}         3{c |} {space 3} {res} 135.84429 {space 3} {res} 1.1380023 {space 3} {res} .15050148  
{txt}         4{c |} {space 3} {res} 123.77625 {space 3} {res} 1.0527395 {space 3} {res} .13931349  
{txt}         5{c |} {space 3} {res} 112.78031 {space 3} {res} .98200164 {space 3} {res} .12942637  
{txt}         6{c |} {space 3} {res} 102.76122 {space 3} {res}  .9233182 {space 3} {res} .12066926  
{txt}         7{c |} {space 3} {res} 93.632197 {space 3} {res} .87463863 {space 3} {res} .11290315  
{txt}         8{c |} {space 3} {res} 85.314171 {space 3} {res} .83388954 {space 3} {res} .10618082  
{txt}         9{c |} {space 3} {res} 77.735095 {space 3} {res} .79791344 {space 3} {res} .10014656  
{txt}        10{c |} {space 3} {res} 70.829323 {space 3} {res} .76478308 {space 3} {res}  .0945916  
{txt}        11{c |} {space 3} {res} 64.537041 {space 3} {res} .73075043 {space 3} {res} .08929697  
{txt}        12{c |} {space 3} {res} 58.803749 {space 3} {res} .69794601 {space 3} {res} .08419117  
{txt}        13{c |} {space 3} {res} 53.579786 {space 3} {res} .66760805 {space 3} {res} .07954682  
{txt}        14{c |} {space 3} {res} 48.819905 {space 3} {res} .64303098 {space 3} {res}  .0759206  
{txt}        15{c |} {space 3} {res} 44.482879 {space 3} {res} .62360464 {space 3} {res} .07330489  
{txt}        16{c |} {space 3} {res} 40.531143 {space 3} {res} .60757305 {space 3} {res}   .071203  ^
{txt}        17{c |} {space 3} {res} 36.930468 {space 3} {res}  .5944141 {space 3} {res} .06954301  
{txt}        18{c |} {space 3} {res} 33.649667 {space 3} {res} .58384932 {space 3} {res} .06827067  
{txt}        19{c |} {space 3} {res} 30.660323 {space 3} {res} .57619284 {space 3} {res} .06735477  
{txt}        20{c |} {space 3} {res} 27.936545 {space 3} {res} .57021823 {space 3} {res} .06671619  
{txt}        21{c |} {space 3} {res} 25.454739 {space 3} {res} .56551762 {space 3} {res} .06663077  
{txt}        22{c |} {space 3} {res}  23.19341 {space 3} {res} .56178246 {space 3} {res} .06675752  
{txt}        23{c |} {space 3} {res} 21.132972 {space 3} {res} .55864071 {space 3} {res} .06709019  
{txt}        24{c |} {space 3} {res} 19.255577 {space 3} {res} .55588447 {space 3} {res} .06766954  
{txt}        25{c |} {space 3} {res} 17.544964 {space 3} {res} .55318906 {space 3} {res} .06825408  
{txt}        26{c |} {space 3} {res} 15.986318 {space 3} {res} .55163258 {space 3} {res} .06867577  
{txt}        27{c |} {space 3} {res} 14.566138 {space 3} {res} .54997013 {space 3} {res} .06918683  
{txt}        28{c |} {space 3} {res} 13.272122 {space 3} {res} .54916268 {space 3} {res} .06986367  
{txt}        29{c |} {space 3} {res} 12.093063 {space 3} {res} .54883378 {space 3} {res}  .0705251  
{txt}        30{c |} {space 3} {res} 11.018749 {space 3} {res} .54837575 {space 3} {res} .07130919  
{txt}        31{c |} {space 3} {res} 10.039874 {space 3} {res} .54764613 {space 3} {res} .07198172  
{txt}        32{c |} {space 3} {res} 9.1479589 {space 3} {res} .54675008 {space 3} {res} .07261519  
{txt}        33{c |} {space 3} {res} 8.3352794 {space 3} {res} .54567545 {space 3} {res} .07324031  
{txt}        34{c |} {space 3} {res} 7.5947962 {space 3} {res} .54487837 {space 3} {res} .07387246  
{txt}        35{c |} {space 3} {res} 6.9200954 {space 3} {res} .54359244 {space 3} {res} .07445954  
{txt}        36{c |} {space 3} {res} 6.3053332 {space 3} {res} .54316955 {space 3} {res} .07506827  
{txt}        37{c |} {space 3} {res} 5.7451848 {space 3} {res} .54302958 {space 3} {res} .07566303  
{txt}        38{c |} {space 3} {res} 5.2347984 {space 3} {res} .54308978 {space 3} {res} .07623492  
{txt}        39{c |} {space 3} {res} 4.7697533 {space 3} {res} .54348572 {space 3} {res} .07677561  
{txt}        40{c |} {space 3} {res} 4.3460216 {space 3} {res} .54404149 {space 3} {res} .07724423  
{txt}        41{c |} {space 3} {res}  3.959933 {space 3} {res} .54463906 {space 3} {res} .07768181  
{txt}        42{c |} {space 3} {res} 3.6081435 {space 3} {res} .54478986 {space 3} {res} .07805877  
{txt}        43{c |} {space 3} {res}  3.287606 {space 3} {res} .54440801 {space 3} {res} .07831011  
{txt}        44{c |} {space 3} {res} 2.9955441 {space 3} {res} .54410234 {space 3} {res} .07853566  
{txt}        45{c |} {space 3} {res} 2.7294282 {space 3} {res} .54361058 {space 3} {res} .07873105  
{txt}        46{c |} {space 3} {res} 2.4869533 {space 3} {res} .54323481 {space 3} {res} .07891818  
{txt}        47{c |} {space 3} {res} 2.2660193 {space 3} {res} .54296868 {space 3} {res} .07909183  
{txt}        48{c |} {space 3} {res} 2.0647124 {space 3} {res} .54244817 {space 3} {res} .07913011  
{txt}        49{c |} {space 3} {res}  1.881289 {space 3} {res} .54198444 {space 3} {res} .07915084  
{txt}        50{c |} {space 3} {res} 1.7141605 {space 3} {res} .54160849 {space 3} {res} .07917137  
{txt}        51{c |} {space 3} {res} 1.5618792 {space 3} {res}  .5413046 {space 3} {res} .07919135  
{txt}        52{c |} {space 3} {res} 1.4231261 {space 3} {res} .54105982 {space 3} {res} .07921058  
{txt}        53{c |} {space 3} {res} 1.2966995 {space 3} {res} .54086344 {space 3} {res}  .0792289  
{txt}        54{c |} {space 3} {res} 1.1815043 {space 3} {res} .54075385 {space 3} {res} .07924727  
{txt}        55{c |} {space 3} {res} 1.0765427 {space 3} {res} .54073494 {space 3} {res} .07926604  
{txt}        56{c |} {space 3} {res} .98090565 {space 3} {res} .54073334 {space 3} {res} .07928375  *
{txt}        57{c |} {space 3} {res} .89376469 {space 3} {res} .54074487 {space 3} {res} .07930038  
{txt}        58{c |} {space 3} {res}  .8143651 {space 3} {res} .54076615 {space 3} {res} .07931592  
{txt}        59{c |} {space 3} {res} .74201915 {space 3} {res} .54079448 {space 3} {res} .07933039  
{txt}        60{c |} {space 3} {res} .67610021 {space 3} {res} .54082773 {space 3} {res} .07934385  
{txt}        61{c |} {space 3} {res} .61603733 {space 3} {res} .54086419 {space 3} {res} .07935632  
{txt}        62{c |} {space 3} {res} .56131027 {space 3} {res} .54090253 {space 3} {res} .07936785  
{txt}        63{c |} {space 3} {res} .51144502 {space 3} {res} .54094171 {space 3} {res} .07937851  
{txt}        64{c |} {space 3} {res} .46600965 {space 3} {res} .54098095 {space 3} {res} .07938833  
{txt}        65{c |} {space 3} {res} .42461064 {space 3} {res} .54101962 {space 3} {res} .07939737  
{txt}        66{c |} {space 3} {res}  .3868894 {space 3} {res}  .5410573 {space 3} {res} .07940569  
{txt}        67{c |} {space 3} {res} .35251921 {space 3} {res} .54109364 {space 3} {res} .07941334  
{txt}        68{c |} {space 3} {res} .32120238 {space 3} {res} .54112843 {space 3} {res} .07942036  
{txt}        69{c |} {space 3} {res} .29266764 {space 3} {res} .54116153 {space 3} {res}  .0794268  
{txt}        70{c |} {space 3} {res} .26666786 {space 3} {res} .54119284 {space 3} {res}  .0794327  
{txt}        71{c |} {space 3} {res} .24297782 {space 3} {res} .54122232 {space 3} {res} .07943811  
{txt}        72{c |} {space 3} {res} .22139234 {space 3} {res} .54124999 {space 3} {res} .07944306  
{txt}        73{c |} {space 3} {res} .20172445 {space 3} {res} .54127891 {space 3} {res} .07944749  
{txt}        74{c |} {space 3} {res} .18380381 {space 3} {res} .54131442 {space 3} {res} .07945125  
{txt}        75{c |} {space 3} {res} .16747519 {space 3} {res} .54134722 {space 3} {res} .07945467  
{txt}        76{c |} {space 3} {res} .15259715 {space 3} {res} .54137747 {space 3} {res}  .0794578  
{txt}        77{c |} {space 3} {res} .13904084 {space 3} {res} .54140534 {space 3} {res} .07946066  
{txt}        78{c |} {space 3} {res} .12668884 {space 3} {res} .54143099 {space 3} {res} .07946326  
{txt}        79{c |} {space 3} {res} .11543415 {space 3} {res} .54145457 {space 3} {res} .07946564  
{txt}        80{c |} {space 3} {res}  .1051793 {space 3} {res} .54147624 {space 3} {res} .07946781  
{txt}        81{c |} {space 3} {res} .09583546 {space 3} {res} .54149612 {space 3} {res} .07946979  
{txt}        82{c |} {space 3} {res}  .0873217 {space 3} {res} .54151436 {space 3} {res}  .0794716  
{txt}        83{c |} {space 3} {res} .07956428 {space 3} {res} .54153108 {space 3} {res} .07947324  
{txt}        84{c |} {space 3} {res} .07249601 {space 3} {res}  .5415464 {space 3} {res} .07947474  
{txt}        85{c |} {space 3} {res} .06605566 {space 3} {res} .54156043 {space 3} {res} .07947611  
{txt}        86{c |} {space 3} {res} .06018746 {space 3} {res} .54157326 {space 3} {res} .07947736  
{txt}        87{c |} {space 3} {res} .05484057 {space 3} {res} .54158501 {space 3} {res}  .0794785  
{txt}        88{c |} {space 3} {res} .04996869 {space 3} {res} .54159575 {space 3} {res} .07947953  
{txt}        89{c |} {space 3} {res} .04552961 {space 3} {res} .54160557 {space 3} {res} .07948048  
{txt}        90{c |} {space 3} {res} .04148488 {space 3} {res} .54161455 {space 3} {res} .07948134  
{txt}        91{c |} {space 3} {res} .03779948 {space 3} {res} .54162275 {space 3} {res} .07948213  
{txt}        92{c |} {space 3} {res} .03444148 {space 3} {res} .54163024 {space 3} {res} .07948284  
{txt}        93{c |} {space 3} {res} .03138179 {space 3} {res} .54163708 {space 3} {res}  .0794835  
{txt}        94{c |} {space 3} {res} .02859392 {space 3} {res} .54164332 {space 3} {res} .07948409  
{txt}        95{c |} {space 3} {res} .02605372 {space 3} {res} .54164903 {space 3} {res} .07948463  
{txt}        96{c |} {space 3} {res} .02373917 {space 3} {res} .54165423 {space 3} {res} .07948513  
{txt}        97{c |} {space 3} {res} .02163025 {space 3} {res} .54165898 {space 3} {res} .07948558  
{txt}        98{c |} {space 3} {res} .01970868 {space 3} {res} .54166331 {space 3} {res} .07948599  
{txt}        99{c |} {space 3} {res} .01795782 {space 3} {res} .54166727 {space 3} {res} .07948636  
{txt}       100{c |} {space 3} {res} .01636249 {space 3} {res} .54167088 {space 3} {res} .07948671  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
{res}{txt}r; t=1.48 12:41:39

{com}. 
. ********************************************************************************
. *** time-series example with rolling cv                                      ***
. ********************************************************************************
. 
. webuse air2, clear
{txt}(TIMESLAB: Airline passengers)
r; t=0.50 12:41:40

{com}.  
. cvlasso air L(1/12).air, rolling origin(130)
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 13-131 (132), 13-132 (133), 13-133 (134), 13-134 (135), 13-135 (136), 13-136 (137), 13-137 (138), 13-138 (139), 13-139 (140), 13-140 (141), 13-141 (142), 13-142 (143), 13-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 33237.193 {space 3} {res} 8731.4325  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 27799.242 {space 3} {res} 7290.3087  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res} 23267.301 {space 3} {res} 6092.3376  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 19493.102 {space 3} {res}  5095.861  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 16349.032 {space 3} {res} 4266.8189  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res} 13729.055 {space 3} {res} 3576.9191  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 11545.052 {space 3} {res} 3002.6587  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 9723.7885 {space 3} {res} 2524.5123  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 8204.3942 {space 3} {res} 2126.2578  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res} 6936.2699 {space 3} {res} 1794.4166  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 5877.3493 {space 3} {res} 1517.7888  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 4992.6553 {space 3} {res} 1287.0672  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 4253.1013 {space 3} {res} 1094.5174  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res}  3635.824 {space 3} {res} 936.22874  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 3111.7137 {space 3} {res} 812.75242  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2669.6887 {space 3} {res} 708.75189  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2300.5206 {space 3} {res} 621.98344  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 1992.0343 {space 3} {res} 549.37699  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1734.1043 {space 3} {res} 488.40062  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1518.3087 {space 3} {res} 436.97343  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res} 1337.6412 {space 3} {res} 393.39186  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1186.2716 {space 3} {res} 356.26673  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 1059.3481 {space 3} {res} 324.46942  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res}  952.8315 {space 3} {res} 297.08581  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 863.35854 {space 3} {res}  273.3769  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res}   788.491 {space 3} {res} 252.67635  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 725.70704 {space 3} {res} 234.57369  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 670.22718 {space 3} {res} 218.23327  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res} 622.52635 {space 3} {res} 203.38451  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 581.16825 {space 3} {res} 190.03867  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res} 546.16451 {space 3} {res} 178.31137  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 516.49556 {space 3} {res} 168.00213  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 491.30969 {space 3} {res} 158.93797  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 469.89498 {space 3} {res} 150.96867  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 451.65601 {space 3} {res}  143.9631  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res} 436.09447 {space 3} {res} 137.80621  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res} 422.79303 {space 3} {res} 132.39667  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res} 411.40189 {space 3} {res} 127.64501  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res} 401.62764 {space 3} {res} 123.47207  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 393.22392 {space 3} {res} 119.80779  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 385.98373 {space 3} {res} 116.59019  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res}  379.7329 {space 3} {res} 113.76442  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 374.32476 {space 3} {res} 111.28209  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 369.63567 {space 3} {res} 109.10052  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 365.56123 {space 3} {res} 107.18216  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res}  362.0132 {space 3} {res} 105.49406  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 358.91691 {space 3} {res} 104.00732  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 356.20904 {space 3} {res} 102.69665  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 353.83583 {space 3} {res} 101.53998  
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res}  352.3553 {space 3} {res} 100.65556  *
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 356.42305 {space 3} {res} 101.19582  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 363.33054 {space 3} {res} 102.75269  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 370.44865 {space 3} {res} 105.00085  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 372.21202 {space 3} {res} 106.53333  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 373.58108 {space 3} {res} 108.17032  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 375.89938 {space 3} {res} 109.80358  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 378.99098 {space 3} {res} 111.37688  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 380.49347 {space 3} {res} 112.55753  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res} 381.08165 {space 3} {res} 113.73224  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res} 381.60207 {space 3} {res} 114.93783  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res} 380.71469 {space 3} {res}  115.6034  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 379.53228 {space 3} {res} 116.00241  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 380.74666 {space 3} {res} 117.01678  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 382.39512 {space 3} {res} 117.92244  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 382.00813 {space 3} {res} 118.30133  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res} 379.53614 {space 3} {res} 118.33073  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res} 377.47621 {space 3} {res} 118.59801  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 376.71111 {space 3} {res} 119.05724  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 376.19828 {space 3} {res} 119.49392  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 375.22278 {space 3} {res} 119.97715  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 373.26668 {space 3} {res} 120.18322  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 372.49456 {space 3} {res} 120.43289  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 372.59088 {space 3} {res} 120.82114  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 374.04884 {space 3} {res} 121.19229  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res}  377.5105 {space 3} {res} 121.17767  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 381.87875 {space 3} {res} 121.00114  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 385.86197 {space 3} {res} 120.80072  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 389.16575 {space 3} {res} 120.36636  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 392.38507 {space 3} {res} 120.08113  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 396.88113 {space 3} {res}  120.4689  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res} 402.63138 {space 3} {res} 121.19743  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 412.30702 {space 3} {res} 121.83665  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 421.09094 {space 3} {res} 121.51485  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 426.86241 {space 3} {res}  120.2055  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 431.12421 {space 3} {res} 119.04316  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 433.74587 {space 3} {res} 118.05604  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 436.53986 {space 3} {res} 117.36929  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 439.42206 {space 3} {res} 116.91838  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res} 442.32753 {space 3} {res} 116.65087  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 445.20676 {space 3} {res}  116.5244  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 448.02273 {space 3} {res} 116.50501  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 450.74836 {space 3} {res} 116.56561  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res} 453.36455 {space 3} {res} 116.68474  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 455.85849 {space 3} {res} 116.84547  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 458.22233 {space 3} {res} 117.03456  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 460.45211 {space 3} {res} 117.24169  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 462.54684 {space 3} {res} 117.45892  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 464.50782 {space 3} {res} 117.68017  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 466.33804 {space 3} {res} 117.90088  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 468.04174 {space 3} {res} 118.11764  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=11.47 12:41:51

{com}. // we should have 144-130=14 folds
. assert 14==`e(nfolds)'
{txt}r; t=0.00 12:41:51

{com}. 
. cvlasso air L(1/12).air, rolling origin(130) h(2)
{txt}Rolling forecasting cross-validation with 2-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (132), 13-131 (133), 13-132 (134), 13-133 (135), 13-134 (136), 13-135 (137), 13-136 (138), 13-137 (139), 13-138 (140), 13-139 (141), 13-140 (142), 13-141 (143), 13-142 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 34952.233 {space 3} {res} 8972.5481  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 29219.469 {space 3} {res} 7495.1704  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res} 24447.167 {space 3} {res} 6266.3552  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 20473.399 {space 3} {res} 5244.0824  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 17163.629 {space 3} {res} 4393.4479  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res}  14406.07 {space 3} {res}  3685.457  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 12107.831 {space 3} {res} 3096.0221  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 10191.716 {space 3} {res} 2605.1314  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 8593.5634 {space 3} {res} 2196.1576  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res}  7260.043 {space 3} {res} 1855.2848  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 6146.8207 {space 3} {res} 1571.0323  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 5217.0365 {space 3} {res} 1333.8591  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 4440.0404 {space 3} {res}  1135.836  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res} 3792.7368 {space 3} {res} 974.00243  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 3245.1003 {space 3} {res} 846.71514  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2784.0987 {space 3} {res}  739.5864  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2399.2025 {space 3} {res} 650.14159  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 2077.6828 {space 3} {res} 575.22206  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1808.9545 {space 3} {res} 512.22553  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1584.2142 {space 3} {res} 459.01598  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res} 1396.1389 {space 3} {res} 413.84709  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1238.6362 {space 3} {res} 375.29686  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 1106.6361 {space 3} {res} 342.21155  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res} 995.91868 {space 3} {res} 313.65775  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 902.97087 {space 3} {res} 288.88156  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res} 825.34561 {space 3} {res} 267.17892  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 760.38714 {space 3} {res} 248.10453  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 703.31872 {space 3} {res} 230.76798  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res} 654.06491 {space 3} {res} 214.98796  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 611.52854 {space 3} {res} 200.84841  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res} 575.54121 {space 3} {res} 188.40654  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 545.05078 {space 3} {res} 177.45417  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 519.17845 {space 3} {res} 167.81145  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 497.18977 {space 3} {res} 159.32199  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 478.47059 {space 3} {res} 151.84907  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res}   462.507 {space 3} {res} 145.27259  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res}  448.8687 {space 3} {res} 139.48664  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res}  437.1951 {space 3} {res} 134.39758  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res}  427.1838 {space 3} {res} 129.92244  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 418.58096 {space 3} {res}  125.9877  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 411.17333 {space 3} {res} 122.52817  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res} 404.78156 {space 3} {res} 119.48615  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 399.25467 {space 3} {res} 116.81057  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 394.46537 {space 3} {res} 114.45638  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 390.30629 {space 3} {res} 112.38385  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res} 386.68666 {space 3} {res} 110.55804  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 383.52972 {space 3} {res}  108.9483  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 380.77038 {space 3} {res} 107.52773  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 378.35345 {space 3} {res} 106.27284  
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res} 377.24088 {space 3} {res} 105.38259  *
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 382.01408 {space 3} {res} 105.95963  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 389.65489 {space 3} {res}  107.7111  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 396.94246 {space 3} {res} 110.12192  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 398.32045 {space 3} {res}  111.7516  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 399.72318 {space 3} {res} 113.59134  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 401.75368 {space 3} {res} 115.49682  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 404.46026 {space 3} {res}  117.3465  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 405.28304 {space 3} {res} 118.73463  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res}  405.2511 {space 3} {res}  120.1721  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res}  405.2761 {space 3} {res} 121.62263  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res} 403.59011 {space 3} {res} 122.41581  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 401.82587 {space 3} {res} 122.98928  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 402.94599 {space 3} {res} 124.26148  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 404.20592 {space 3} {res} 125.21789  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 403.68408 {space 3} {res} 125.62712  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res} 400.91215 {space 3} {res} 125.64499  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res}  398.9517 {space 3} {res} 126.02457  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 397.76927 {space 3} {res} 126.60418  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 396.84309 {space 3} {res} 127.16789  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 395.36465 {space 3} {res} 127.77929  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 392.86311 {space 3} {res} 128.06788  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 391.49788 {space 3} {res} 128.48992  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 391.07007 {space 3} {res} 129.00451  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 392.16177 {space 3} {res} 129.49754  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res} 395.08297 {space 3} {res} 129.54637  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 398.32513 {space 3} {res} 129.52706  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 401.15399 {space 3} {res} 129.44648  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 403.24593 {space 3} {res} 129.10851  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 405.54289 {space 3} {res} 128.94792  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 409.33005 {space 3} {res} 129.52204  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res} 414.58054 {space 3} {res} 130.50225  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 423.29174 {space 3} {res} 131.10197  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 431.51624 {space 3} {res} 130.67818  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 436.86415 {space 3} {res} 129.31034  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 440.37741 {space 3} {res} 128.09369  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 442.49849 {space 3} {res} 127.09852  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 444.85132 {space 3} {res} 126.41494  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 447.34397 {space 3} {res} 125.97551  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res}  449.9048 {space 3} {res} 125.72547  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 452.47857 {space 3} {res} 125.62067  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 455.02332 {space 3} {res} 125.62572  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 457.50773 {space 3} {res} 125.71243  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res} 459.90901 {space 3} {res} 125.85849  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 462.21121 {space 3} {res} 126.04634  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 464.40372 {space 3} {res} 126.26225  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 466.48019 {space 3} {res} 126.49555  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 468.43756 {space 3} {res} 126.73804  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 470.27531 {space 3} {res} 126.98348  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 471.99485 {space 3} {res} 127.22718  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 473.59904 {space 3} {res} 127.46568  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=10.72 12:42:02

{com}. // we should have 144-130-1=14 folds
. assert 13==`e(nfolds)'
{txt}r; t=0.00 12:42:02

{com}. 
. cvlasso air L(1/12).air, rolling origin(130) fixedwin
{txt}Rolling forecasting cross-validation with 1-step ahead forecasts. Elastic net with alpha=1.
Training from-to (validation point): {res}13-130 (131), 14-131 (132), 15-132 (133), 16-133 (134), 17-134 (135), 18-135 (136), 19-136 (137), 20-137 (138), 21-138 (139), 22-139 (140), 23-140 (141), 24-141 (142), 25-142 (143), 26-143 (144).
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 30083.535 {space 3} {res} 29342.536 {space 3} {res} 7604.6329  
{txt}         2{c |} {space 3} {res} 27410.996 {space 3} {res} 24556.677 {space 3} {res} 6355.4314  
{txt}         3{c |} {space 3} {res} 24975.879 {space 3} {res}  20570.95 {space 3} {res} 5316.2899  
{txt}         4{c |} {space 3} {res} 22757.091 {space 3} {res} 17250.611 {space 3} {res} 4451.7039  
{txt}         5{c |} {space 3} {res} 20735.414 {space 3} {res} 14483.694 {space 3} {res} 3732.1806  
{txt}         6{c |} {space 3} {res} 18893.337 {space 3} {res} 12177.154 {space 3} {res} 3133.2195  
{txt}         7{c |} {space 3} {res} 17214.905 {space 3} {res} 10253.662 {space 3} {res}  2634.466  
{txt}         8{c |} {space 3} {res}  15685.58 {space 3} {res} 8648.9434 {space 3} {res} 2219.0087  
{txt}         9{c |} {space 3} {res} 14292.116 {space 3} {res} 7309.5692 {space 3} {res} 1872.7961  
{txt}        10{c |} {space 3} {res} 13022.444 {space 3} {res} 6191.1202 {space 3} {res} 1584.1517  
{txt}        11{c |} {space 3} {res} 11865.566 {space 3} {res} 5256.6626 {space 3} {res} 1343.3724  
{txt}        12{c |} {space 3} {res} 10811.462 {space 3} {res} 4475.4822 {space 3} {res} 1142.3943  
{txt}        13{c |} {space 3} {res} 9851.0014 {space 3} {res} 3822.0328 {space 3} {res} 974.51561  
{txt}        14{c |} {space 3} {res} 8975.8656 {space 3} {res} 3272.4349 {space 3} {res} 844.16278  
{txt}        15{c |} {space 3} {res} 8178.4744 {space 3} {res} 2805.5335 {space 3} {res} 735.84716  
{txt}        16{c |} {space 3} {res} 7451.9213 {space 3} {res} 2415.5597 {space 3} {res}  645.3886  
{txt}        17{c |} {space 3} {res} 6789.9131 {space 3} {res} 2089.5994 {space 3} {res} 569.63807  
{txt}        18{c |} {space 3} {res}  6186.716 {space 3} {res} 1816.9795 {space 3} {res} 505.97842  
{txt}        19{c |} {space 3} {res} 5637.1052 {space 3} {res} 1588.8216 {space 3} {res} 452.25745  
{txt}        20{c |} {space 3} {res} 5136.3203 {space 3} {res} 1397.7387 {space 3} {res}  406.7116  
{txt}        21{c |} {space 3} {res} 4680.0237 {space 3} {res}  1237.584 {space 3} {res} 367.90116  
{txt}        22{c |} {space 3} {res} 4264.2633 {space 3} {res} 1103.2409 {space 3} {res} 334.65486  
{txt}        23{c |} {space 3} {res} 3885.4379 {space 3} {res} 990.44955 {space 3} {res} 306.02247  
{txt}        24{c |} {space 3} {res} 3540.2663 {space 3} {res}  895.6626 {space 3} {res} 281.23456  
{txt}        25{c |} {space 3} {res} 3225.7588 {space 3} {res} 816.25649 {space 3} {res} 259.59417  
{txt}        26{c |} {space 3} {res} 2939.1913 {space 3} {res} 750.07662 {space 3} {res} 240.58066  
{txt}        27{c |} {space 3} {res} 2678.0817 {space 3} {res} 693.47635 {space 3} {res} 223.73861  
{txt}        28{c |} {space 3} {res} 2440.1683 {space 3} {res} 643.46868 {space 3} {res} 208.49267  
{txt}        29{c |} {space 3} {res} 2223.3904 {space 3} {res}  599.2883 {space 3} {res}  194.5465  
{txt}        30{c |} {space 3} {res} 2025.8706 {space 3} {res} 561.87629 {space 3} {res} 182.29443  
{txt}        31{c |} {space 3} {res} 1845.8978 {space 3} {res}  530.1486 {space 3} {res} 171.52546  
{txt}        32{c |} {space 3} {res} 1681.9133 {space 3} {res} 503.19944 {space 3} {res} 162.05771  
{txt}        33{c |} {space 3} {res} 1532.4968 {space 3} {res} 480.27153 {space 3} {res} 153.73349  
{txt}        34{c |} {space 3} {res}  1396.354 {space 3} {res} 460.73137 {space 3} {res} 146.41531  
{txt}        35{c |} {space 3} {res} 1272.3058 {space 3} {res} 444.04865 {space 3} {res} 139.98272  ^
{txt}        36{c |} {space 3} {res} 1159.2776 {space 3} {res}  429.7791 {space 3} {res} 134.32978  
{txt}        37{c |} {space 3} {res} 1056.2906 {space 3} {res} 417.55025 {space 3} {res} 129.36305  
{txt}        38{c |} {space 3} {res} 962.45264 {space 3} {res} 407.04957 {space 3} {res} 124.99996  
{txt}        39{c |} {space 3} {res}   876.951 {space 3} {res} 398.01456 {space 3} {res} 121.16748  
{txt}        40{c |} {space 3} {res} 799.04509 {space 3} {res} 390.22455 {space 3} {res} 117.80101  
{txt}        41{c |} {space 3} {res} 728.06013 {space 3} {res} 383.49384 {space 3} {res} 114.84345  
{txt}        42{c |} {space 3} {res} 663.38127 {space 3} {res} 377.66597 {space 3} {res}  112.2444  
{txt}        43{c |} {space 3} {res} 604.44831 {space 3} {res} 372.60897 {space 3} {res} 109.95941  
{txt}        44{c |} {space 3} {res} 550.75079 {space 3} {res} 368.21137 {space 3} {res} 107.94939  
{txt}        45{c |} {space 3} {res} 501.82361 {space 3} {res} 364.37892 {space 3} {res} 106.17998  
{txt}        46{c |} {space 3} {res} 457.24298 {space 3} {res} 361.03178 {space 3} {res} 104.62109  
{txt}        47{c |} {space 3} {res} 416.62277 {space 3} {res} 358.10226 {space 3} {res} 103.24635  
{txt}        48{c |} {space 3} {res} 379.61115 {space 3} {res} 355.53282 {space 3} {res} 102.03273  
{txt}        49{c |} {space 3} {res} 345.88755 {space 3} {res} 353.27454 {space 3} {res} 100.96014  *
{txt}        50{c |} {space 3} {res} 315.15985 {space 3} {res} 353.56351 {space 3} {res} 100.54566  
{txt}        51{c |} {space 3} {res} 287.16192 {space 3} {res} 358.15619 {space 3} {res} 101.22159  
{txt}        52{c |} {space 3} {res} 261.65124 {space 3} {res} 365.35705 {space 3} {res} 102.96975  
{txt}        53{c |} {space 3} {res} 238.40687 {space 3} {res} 369.66508 {space 3} {res} 104.79961  
{txt}        54{c |} {space 3} {res} 217.22746 {space 3} {res} 370.95016 {space 3} {res} 106.38565  
{txt}        55{c |} {space 3} {res} 197.92957 {space 3} {res} 372.74966 {space 3} {res} 108.15476  
{txt}        56{c |} {space 3} {res} 180.34605 {space 3} {res} 375.87984 {space 3} {res} 109.75375  
{txt}        57{c |} {space 3} {res} 164.32461 {space 3} {res} 378.13286 {space 3} {res} 111.19205  
{txt}        58{c |} {space 3} {res} 149.72646 {space 3} {res} 379.31752 {space 3} {res} 112.39925  
{txt}        59{c |} {space 3} {res} 136.42518 {space 3} {res} 379.96884 {space 3} {res} 113.65128  
{txt}        60{c |} {space 3} {res} 124.30554 {space 3} {res} 379.47216 {space 3} {res} 114.64207  
{txt}        61{c |} {space 3} {res} 113.26258 {space 3} {res}  378.6107 {space 3} {res}  115.2831  
{txt}        62{c |} {space 3} {res} 103.20064 {space 3} {res} 379.47067 {space 3} {res} 116.07434  
{txt}        63{c |} {space 3} {res} 94.032582 {space 3} {res} 380.87369 {space 3} {res} 116.91882  
{txt}        64{c |} {space 3} {res} 85.678986 {space 3} {res} 382.03715 {space 3} {res} 117.67983  
{txt}        65{c |} {space 3} {res} 78.067501 {space 3} {res} 380.53668 {space 3} {res} 118.00548  
{txt}        66{c |} {space 3} {res}   71.1322 {space 3} {res}   377.904 {space 3} {res}  117.9601  
{txt}        67{c |} {space 3} {res} 64.813011 {space 3} {res} 376.68599 {space 3} {res} 118.51554  
{txt}        68{c |} {space 3} {res} 59.055202 {space 3} {res} 376.04184 {space 3} {res}  118.9979  
{txt}        69{c |} {space 3} {res}   53.8089 {space 3} {res} 375.66725 {space 3} {res} 119.47501  
{txt}        70{c |} {space 3} {res} 49.028666 {space 3} {res} 374.18355 {space 3} {res} 120.01102  
{txt}        71{c |} {space 3} {res} 44.673094 {space 3} {res} 372.68744 {space 3} {res} 120.23184  
{txt}        72{c |} {space 3} {res}  40.70446 {space 3} {res} 372.63602 {space 3} {res} 120.62715  
{txt}        73{c |} {space 3} {res} 37.088388 {space 3} {res} 372.96002 {space 3} {res} 120.98856  
{txt}        74{c |} {space 3} {res} 33.793558 {space 3} {res} 375.67225 {space 3} {res}  121.2765  
{txt}        75{c |} {space 3} {res} 30.791431 {space 3} {res} 379.83266 {space 3} {res} 121.13771  
{txt}        76{c |} {space 3} {res} 28.056005 {space 3} {res} 383.96921 {space 3} {res} 121.02467  
{txt}        77{c |} {space 3} {res} 25.563587 {space 3} {res} 387.82565 {space 3} {res} 120.59418  
{txt}        78{c |} {space 3} {res} 23.292588 {space 3} {res} 391.20473 {space 3} {res} 120.20296  
{txt}        79{c |} {space 3} {res} 21.223339 {space 3} {res} 395.06233 {space 3} {res} 120.19574  
{txt}        80{c |} {space 3} {res} 19.337916 {space 3} {res} 400.12432 {space 3} {res} 120.81217  
{txt}        81{c |} {space 3} {res} 17.619989 {space 3} {res}  408.9831 {space 3} {res} 121.88139  
{txt}        82{c |} {space 3} {res} 16.054678 {space 3} {res} 419.70456 {space 3} {res} 122.19761  
{txt}        83{c |} {space 3} {res} 14.628424 {space 3} {res} 427.29042 {space 3} {res} 121.84983  
{txt}        84{c |} {space 3} {res} 13.328875 {space 3} {res} 432.32449 {space 3} {res} 120.51138  
{txt}        85{c |} {space 3} {res} 12.144775 {space 3} {res} 434.70003 {space 3} {res} 119.27437  
{txt}        86{c |} {space 3} {res} 11.065867 {space 3} {res} 437.29344 {space 3} {res}  118.3797  
{txt}        87{c |} {space 3} {res} 10.082806 {space 3} {res} 440.01255 {space 3} {res} 117.75625  
{txt}        88{c |} {space 3} {res} 9.1870769 {space 3} {res} 442.78574 {space 3} {res} 117.34583  
{txt}        89{c |} {space 3} {res} 8.3709223 {space 3} {res} 445.55799 {space 3} {res} 117.10114  
{txt}        90{c |} {space 3} {res} 7.6272726 {space 3} {res} 448.28774 {space 3} {res} 116.98402  
{txt}        91{c |} {space 3} {res} 6.9496867 {space 3} {res} 450.94415 {space 3} {res} 116.96386  
{txt}        92{c |} {space 3} {res} 6.3322957 {space 3} {res} 453.50503 {space 3} {res} 117.01624  
{txt}        93{c |} {space 3} {res}  5.769752 {space 3} {res}   455.955 {space 3} {res} 117.12177  
{txt}        94{c |} {space 3} {res} 5.2571831 {space 3} {res} 458.28413 {space 3} {res} 117.26519  
{txt}        95{c |} {space 3} {res} 4.7901495 {space 3} {res} 460.48672 {space 3} {res} 117.43449  
{txt}        96{c |} {space 3} {res} 4.3646058 {space 3} {res} 462.56036 {space 3} {res} 117.62036  
{txt}        97{c |} {space 3} {res} 3.9768663 {space 3} {res} 464.50518 {space 3} {res} 117.81559  
{txt}        98{c |} {space 3} {res} 3.6235724 {space 3} {res} 466.32322 {space 3} {res} 118.01467  
{txt}        99{c |} {space 3} {res} 3.3016642 {space 3} {res} 468.01793 {space 3} {res} 118.21343  
{txt}       100{c |} {space 3} {res} 3.0083535 {space 3} {res} 469.59378 {space 3} {res} 118.40879  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=11.55 12:42:13

{com}. assert 14==`e(nfolds)'
{txt}r; t=0.00 12:42:13

{com}. 
. ********************************************************************************
. *** panel example
. ********************************************************************************
. 
. use "http://fmwww.bc.edu/ec-p/data/macro/abdata.dta", clear
{txt}(Layard & Nickell, Unemployment in Britain, Economica 53, 1986 from Ox dist)
r; t=0.64 12:42:14

{com}. 
. // FE and noftools options
. cvlasso ys l(0/3).k l(0/3).n, fe seed(123)
{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 46.945458 {space 3} {res} .00843492 {space 3} {res} .00058496  
{txt}         2{c |} {space 3} {res} 42.774952 {space 3} {res} .00813196 {space 3} {res}  .0005897  
{txt}         3{c |} {space 3} {res} 38.974944 {space 3} {res} .00773276 {space 3} {res} .00056315  
{txt}         4{c |} {space 3} {res} 35.512517 {space 3} {res} .00737473 {space 3} {res} .00053581  
{txt}         5{c |} {space 3} {res} 32.357683 {space 3} {res} .00706573 {space 3} {res}  .0005092  
{txt}         6{c |} {space 3} {res} 29.483116 {space 3} {res}  .0068078 {space 3} {res}  .0004852  
{txt}         7{c |} {space 3} {res} 26.863917 {space 3} {res} .00659238 {space 3} {res}  .0004636  
{txt}         8{c |} {space 3} {res}   24.4774 {space 3} {res} .00641237 {space 3} {res} .00044421  
{txt}         9{c |} {space 3} {res} 22.302896 {space 3} {res} .00626186 {space 3} {res} .00042685  
{txt}        10{c |} {space 3} {res} 20.321568 {space 3} {res} .00613594 {space 3} {res} .00041134  
{txt}        11{c |} {space 3} {res} 18.516256 {space 3} {res} .00603053 {space 3} {res} .00039754  
{txt}        12{c |} {space 3} {res} 16.871323 {space 3} {res}  .0059422 {space 3} {res} .00038527  
{txt}        13{c |} {space 3} {res} 15.372521 {space 3} {res} .00586815 {space 3} {res} .00037439  
{txt}        14{c |} {space 3} {res} 14.006868 {space 3} {res} .00580767 {space 3} {res} .00036394  
{txt}        15{c |} {space 3} {res} 12.762537 {space 3} {res} .00575894 {space 3} {res} .00035376  
{txt}        16{c |} {space 3} {res} 11.628748 {space 3} {res} .00571635 {space 3} {res} .00034367  
{txt}        17{c |} {space 3} {res} 10.595682 {space 3} {res} .00567365 {space 3} {res} .00033312  
{txt}        18{c |} {space 3} {res} 9.6543911 {space 3} {res} .00563169 {space 3} {res} .00032285  
{txt}        19{c |} {space 3} {res} 8.7967216 {space 3} {res} .00558916 {space 3} {res} .00031273  ^
{txt}        20{c |} {space 3} {res} 8.0152451 {space 3} {res} .00555189 {space 3} {res} .00030398  
{txt}        21{c |} {space 3} {res} 7.3031928 {space 3} {res} .00551614 {space 3} {res} .00029582  
{txt}        22{c |} {space 3} {res} 6.6543973 {space 3} {res}  .0054842 {space 3} {res} .00028853  
{txt}        23{c |} {space 3} {res}  6.063239 {space 3} {res} .00545554 {space 3} {res} .00028109  
{txt}        24{c |} {space 3} {res} 5.5245976 {space 3} {res} .00543376 {space 3} {res} .00027373  
{txt}        25{c |} {space 3} {res} 5.0338075 {space 3} {res} .00541646 {space 3} {res} .00026706  
{txt}        26{c |} {space 3} {res} 4.5866179 {space 3} {res} .00540234 {space 3} {res} .00026121  
{txt}        27{c |} {space 3} {res} 4.1791554 {space 3} {res} .00539083 {space 3} {res} .00025608  
{txt}        28{c |} {space 3} {res} 3.8078908 {space 3} {res} .00538147 {space 3} {res} .00025161  
{txt}        29{c |} {space 3} {res} 3.4696083 {space 3} {res} .00537447 {space 3} {res} .00024786  
{txt}        30{c |} {space 3} {res} 3.1613778 {space 3} {res} .00536953 {space 3} {res} .00024474  
{txt}        31{c |} {space 3} {res} 2.8805297 {space 3} {res} .00536569 {space 3} {res} .00024204  
{txt}        32{c |} {space 3} {res} 2.6246314 {space 3} {res} .00536274 {space 3} {res}  .0002397  
{txt}        33{c |} {space 3} {res} 2.3914664 {space 3} {res} .00536129 {space 3} {res} .00023773  
{txt}        34{c |} {space 3} {res} 2.1790151 {space 3} {res}  .0053607 {space 3} {res} .00023603  
{txt}        35{c |} {space 3} {res} 1.9854374 {space 3} {res} .00536049 {space 3} {res} .00023456  *
{txt}        36{c |} {space 3} {res} 1.8090566 {space 3} {res}  .0053616 {space 3} {res} .00023354  
{txt}        37{c |} {space 3} {res}  1.648345 {space 3} {res} .00536378 {space 3} {res} .00023229  
{txt}        38{c |} {space 3} {res} 1.5019106 {space 3} {res} .00536851 {space 3} {res} .00023011  
{txt}        39{c |} {space 3} {res}  1.368485 {space 3} {res}  .0053741 {space 3} {res} .00022843  
{txt}        40{c |} {space 3} {res} 1.2469126 {space 3} {res} .00537969 {space 3} {res} .00022697  
{txt}        41{c |} {space 3} {res} 1.1361403 {space 3} {res} .00538588 {space 3} {res} .00022581  
{txt}        42{c |} {space 3} {res} 1.0352087 {space 3} {res} .00539219 {space 3} {res} .00022482  
{txt}        43{c |} {space 3} {res} .94324363 {space 3} {res} .00539811 {space 3} {res} .00022394  
{txt}        44{c |} {space 3} {res} .85944846 {space 3} {res} .00540365 {space 3} {res} .00022315  
{txt}        45{c |} {space 3} {res} .78309743 {space 3} {res} .00540967 {space 3} {res} .00022263  
{txt}        46{c |} {space 3} {res} .71352921 {space 3} {res}  .0054163 {space 3} {res} .00022214  
{txt}        47{c |} {space 3} {res} .65014124 {space 3} {res} .00542284 {space 3} {res} .00022161  
{txt}        48{c |} {space 3} {res} .59238449 {space 3} {res} .00542906 {space 3} {res} .00022113  
{txt}        49{c |} {space 3} {res} .53975868 {space 3} {res} .00543495 {space 3} {res} .00022071  
{txt}        50{c |} {space 3} {res} .49180801 {space 3} {res} .00544044 {space 3} {res} .00022032  
{txt}        51{c |} {space 3} {res} .44811714 {space 3} {res} .00544564 {space 3} {res} .00021997  
{txt}        52{c |} {space 3} {res} .40830765 {space 3} {res} .00545058 {space 3} {res} .00021961  
{txt}        53{c |} {space 3} {res} .37203472 {space 3} {res}   .005455 {space 3} {res} .00021921  
{txt}        54{c |} {space 3} {res} .33898418 {space 3} {res} .00545904 {space 3} {res} .00021881  
{txt}        55{c |} {space 3} {res} .30886976 {space 3} {res}  .0054628 {space 3} {res} .00021846  
{txt}        56{c |} {space 3} {res} .28143062 {space 3} {res}  .0054662 {space 3} {res} .00021811  
{txt}        57{c |} {space 3} {res}  .2564291 {space 3} {res} .00546937 {space 3} {res} .00021779  
{txt}        58{c |} {space 3} {res} .23364865 {space 3} {res} .00547234 {space 3} {res} .00021749  
{txt}        59{c |} {space 3} {res} .21289195 {space 3} {res} .00547504 {space 3} {res} .00021723  
{txt}        60{c |} {space 3} {res} .19397921 {space 3} {res} .00547749 {space 3} {res}   .000217  
{txt}        61{c |} {space 3} {res} .17674663 {space 3} {res} .00547977 {space 3} {res}  .0002168  
{txt}        62{c |} {space 3} {res} .16104495 {space 3} {res} .00548186 {space 3} {res} .00021661  
{txt}        63{c |} {space 3} {res} .14673816 {space 3} {res} .00548379 {space 3} {res} .00021644  
{txt}        64{c |} {space 3} {res} .13370235 {space 3} {res} .00548546 {space 3} {res} .00021627  
{txt}        65{c |} {space 3} {res}  .1218246 {space 3} {res} .00548693 {space 3} {res} .00021611  
{txt}        66{c |} {space 3} {res} .11100204 {space 3} {res}  .0054883 {space 3} {res} .00021597  
{txt}        67{c |} {space 3} {res} .10114092 {space 3} {res} .00548956 {space 3} {res} .00021584  
{txt}        68{c |} {space 3} {res} .09215584 {space 3} {res}  .0054907 {space 3} {res} .00021572  
{txt}        69{c |} {space 3} {res} .08396897 {space 3} {res} .00549175 {space 3} {res} .00021561  
{txt}        70{c |} {space 3} {res}  .0765094 {space 3} {res} .00549272 {space 3} {res} .00021552  
{txt}        71{c |} {space 3} {res} .06971251 {space 3} {res}  .0054936 {space 3} {res} .00021543  
{txt}        72{c |} {space 3} {res} .06351945 {space 3} {res}  .0054944 {space 3} {res} .00021535  
{txt}        73{c |} {space 3} {res} .05787655 {space 3} {res} .00549514 {space 3} {res} .00021528  
{txt}        74{c |} {space 3} {res} .05273496 {space 3} {res} .00549581 {space 3} {res} .00021521  
{txt}        75{c |} {space 3} {res} .04805013 {space 3} {res} .00549642 {space 3} {res} .00021515  
{txt}        76{c |} {space 3} {res} .04378149 {space 3} {res} .00549698 {space 3} {res}  .0002151  
{txt}        77{c |} {space 3} {res} .03989206 {space 3} {res}  .0054975 {space 3} {res} .00021505  
{txt}        78{c |} {space 3} {res} .03634816 {space 3} {res} .00549796 {space 3} {res}   .000215  
{txt}        79{c |} {space 3} {res} .03311909 {space 3} {res} .00549839 {space 3} {res} .00021496  
{txt}        80{c |} {space 3} {res} .03017688 {space 3} {res} .00549878 {space 3} {res} .00021493  
{txt}        81{c |} {space 3} {res} .02749605 {space 3} {res} .00549914 {space 3} {res} .00021489  
{txt}        82{c |} {space 3} {res} .02505338 {space 3} {res} .00549946 {space 3} {res} .00021486  
{txt}        83{c |} {space 3} {res} .02282771 {space 3} {res} .00549976 {space 3} {res} .00021483  
{txt}        84{c |} {space 3} {res} .02079976 {space 3} {res} .00550003 {space 3} {res} .00021481  
{txt}        85{c |} {space 3} {res} .01895196 {space 3} {res} .00550027 {space 3} {res} .00021478  
{txt}        86{c |} {space 3} {res} .01726832 {space 3} {res}  .0055005 {space 3} {res} .00021476  
{txt}        87{c |} {space 3} {res} .01573425 {space 3} {res}  .0055007 {space 3} {res} .00021474  
{txt}        88{c |} {space 3} {res} .01433646 {space 3} {res} .00550089 {space 3} {res} .00021472  
{txt}        89{c |} {space 3} {res} .01306285 {space 3} {res} .00550106 {space 3} {res} .00021471  
{txt}        90{c |} {space 3} {res} .01190238 {space 3} {res} .00550121 {space 3} {res} .00021469  
{txt}        91{c |} {space 3} {res} .01084501 {space 3} {res} .00550136 {space 3} {res} .00021468  
{txt}        92{c |} {space 3} {res} .00988157 {space 3} {res} .00550148 {space 3} {res} .00021467  
{txt}        93{c |} {space 3} {res} .00900372 {space 3} {res}  .0055016 {space 3} {res} .00021466  
{txt}        94{c |} {space 3} {res} .00820385 {space 3} {res} .00550171 {space 3} {res} .00021465  
{txt}        95{c |} {space 3} {res} .00747504 {space 3} {res} .00550181 {space 3} {res} .00021464  
{txt}        96{c |} {space 3} {res} .00681098 {space 3} {res}  .0055019 {space 3} {res} .00021463  
{txt}        97{c |} {space 3} {res} .00620591 {space 3} {res} .00550198 {space 3} {res} .00021462  
{txt}        98{c |} {space 3} {res}  .0056546 {space 3} {res} .00550205 {space 3} {res} .00021461  
{txt}        99{c |} {space 3} {res} .00515226 {space 3} {res} .00550212 {space 3} {res} .00021461  
{txt}       100{c |} {space 3} {res} .00469455 {space 3} {res} .00550218 {space 3} {res}  .0002146  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=0.87 12:42:15

{com}. savedresults save ftools e()
{txt}r; t=0.00 12:42:15

{com}. cap noi assert "`e(noftools)'"==""  // will be error if ftools not installed
{txt}r; t=0.00 12:42:15

{com}. cvlasso ys l(0/3).k l(0/3).n, fe seed(123) noftools
{txt}K-fold cross-validation with 10 folds. Elastic net with alpha=1.
Fold {res}1 2 3 4 5 6 7 8 9 10 
{txt}          {c |} {space 3} {txt}    Lambda {space 3} {txt}      MSPE {space 3} {txt}  st. dev.
{hline 10}{c +}{hline 45}
{txt}         1{c |} {space 3} {res} 46.945458 {space 3} {res} .00843492 {space 3} {res} .00058496  
{txt}         2{c |} {space 3} {res} 42.774952 {space 3} {res} .00813196 {space 3} {res}  .0005897  
{txt}         3{c |} {space 3} {res} 38.974944 {space 3} {res} .00773276 {space 3} {res} .00056315  
{txt}         4{c |} {space 3} {res} 35.512517 {space 3} {res} .00737473 {space 3} {res} .00053581  
{txt}         5{c |} {space 3} {res} 32.357683 {space 3} {res} .00706573 {space 3} {res}  .0005092  
{txt}         6{c |} {space 3} {res} 29.483116 {space 3} {res}  .0068078 {space 3} {res}  .0004852  
{txt}         7{c |} {space 3} {res} 26.863917 {space 3} {res} .00659238 {space 3} {res}  .0004636  
{txt}         8{c |} {space 3} {res}   24.4774 {space 3} {res} .00641237 {space 3} {res} .00044421  
{txt}         9{c |} {space 3} {res} 22.302896 {space 3} {res} .00626186 {space 3} {res} .00042685  
{txt}        10{c |} {space 3} {res} 20.321568 {space 3} {res} .00613594 {space 3} {res} .00041134  
{txt}        11{c |} {space 3} {res} 18.516256 {space 3} {res} .00603053 {space 3} {res} .00039754  
{txt}        12{c |} {space 3} {res} 16.871323 {space 3} {res}  .0059422 {space 3} {res} .00038527  
{txt}        13{c |} {space 3} {res} 15.372521 {space 3} {res} .00586815 {space 3} {res} .00037439  
{txt}        14{c |} {space 3} {res} 14.006868 {space 3} {res} .00580767 {space 3} {res} .00036394  
{txt}        15{c |} {space 3} {res} 12.762537 {space 3} {res} .00575894 {space 3} {res} .00035376  
{txt}        16{c |} {space 3} {res} 11.628748 {space 3} {res} .00571635 {space 3} {res} .00034367  
{txt}        17{c |} {space 3} {res} 10.595682 {space 3} {res} .00567365 {space 3} {res} .00033312  
{txt}        18{c |} {space 3} {res} 9.6543911 {space 3} {res} .00563169 {space 3} {res} .00032285  
{txt}        19{c |} {space 3} {res} 8.7967216 {space 3} {res} .00558916 {space 3} {res} .00031273  ^
{txt}        20{c |} {space 3} {res} 8.0152451 {space 3} {res} .00555189 {space 3} {res} .00030398  
{txt}        21{c |} {space 3} {res} 7.3031928 {space 3} {res} .00551614 {space 3} {res} .00029582  
{txt}        22{c |} {space 3} {res} 6.6543973 {space 3} {res}  .0054842 {space 3} {res} .00028853  
{txt}        23{c |} {space 3} {res}  6.063239 {space 3} {res} .00545554 {space 3} {res} .00028109  
{txt}        24{c |} {space 3} {res} 5.5245976 {space 3} {res} .00543376 {space 3} {res} .00027373  
{txt}        25{c |} {space 3} {res} 5.0338075 {space 3} {res} .00541646 {space 3} {res} .00026706  
{txt}        26{c |} {space 3} {res} 4.5866179 {space 3} {res} .00540234 {space 3} {res} .00026121  
{txt}        27{c |} {space 3} {res} 4.1791554 {space 3} {res} .00539083 {space 3} {res} .00025608  
{txt}        28{c |} {space 3} {res} 3.8078908 {space 3} {res} .00538147 {space 3} {res} .00025161  
{txt}        29{c |} {space 3} {res} 3.4696083 {space 3} {res} .00537447 {space 3} {res} .00024786  
{txt}        30{c |} {space 3} {res} 3.1613778 {space 3} {res} .00536953 {space 3} {res} .00024474  
{txt}        31{c |} {space 3} {res} 2.8805297 {space 3} {res} .00536569 {space 3} {res} .00024204  
{txt}        32{c |} {space 3} {res} 2.6246314 {space 3} {res} .00536274 {space 3} {res}  .0002397  
{txt}        33{c |} {space 3} {res} 2.3914664 {space 3} {res} .00536129 {space 3} {res} .00023773  
{txt}        34{c |} {space 3} {res} 2.1790151 {space 3} {res}  .0053607 {space 3} {res} .00023603  
{txt}        35{c |} {space 3} {res} 1.9854374 {space 3} {res} .00536049 {space 3} {res} .00023456  *
{txt}        36{c |} {space 3} {res} 1.8090566 {space 3} {res}  .0053616 {space 3} {res} .00023354  
{txt}        37{c |} {space 3} {res}  1.648345 {space 3} {res} .00536378 {space 3} {res} .00023229  
{txt}        38{c |} {space 3} {res} 1.5019106 {space 3} {res} .00536851 {space 3} {res} .00023011  
{txt}        39{c |} {space 3} {res}  1.368485 {space 3} {res}  .0053741 {space 3} {res} .00022843  
{txt}        40{c |} {space 3} {res} 1.2469126 {space 3} {res} .00537969 {space 3} {res} .00022697  
{txt}        41{c |} {space 3} {res} 1.1361403 {space 3} {res} .00538588 {space 3} {res} .00022581  
{txt}        42{c |} {space 3} {res} 1.0352087 {space 3} {res} .00539219 {space 3} {res} .00022482  
{txt}        43{c |} {space 3} {res} .94324363 {space 3} {res} .00539811 {space 3} {res} .00022394  
{txt}        44{c |} {space 3} {res} .85944846 {space 3} {res} .00540365 {space 3} {res} .00022315  
{txt}        45{c |} {space 3} {res} .78309743 {space 3} {res} .00540967 {space 3} {res} .00022263  
{txt}        46{c |} {space 3} {res} .71352921 {space 3} {res}  .0054163 {space 3} {res} .00022214  
{txt}        47{c |} {space 3} {res} .65014124 {space 3} {res} .00542284 {space 3} {res} .00022161  
{txt}        48{c |} {space 3} {res} .59238449 {space 3} {res} .00542906 {space 3} {res} .00022113  
{txt}        49{c |} {space 3} {res} .53975868 {space 3} {res} .00543495 {space 3} {res} .00022071  
{txt}        50{c |} {space 3} {res} .49180801 {space 3} {res} .00544044 {space 3} {res} .00022032  
{txt}        51{c |} {space 3} {res} .44811714 {space 3} {res} .00544564 {space 3} {res} .00021997  
{txt}        52{c |} {space 3} {res} .40830765 {space 3} {res} .00545058 {space 3} {res} .00021961  
{txt}        53{c |} {space 3} {res} .37203472 {space 3} {res}   .005455 {space 3} {res} .00021921  
{txt}        54{c |} {space 3} {res} .33898418 {space 3} {res} .00545904 {space 3} {res} .00021881  
{txt}        55{c |} {space 3} {res} .30886976 {space 3} {res}  .0054628 {space 3} {res} .00021846  
{txt}        56{c |} {space 3} {res} .28143062 {space 3} {res}  .0054662 {space 3} {res} .00021811  
{txt}        57{c |} {space 3} {res}  .2564291 {space 3} {res} .00546937 {space 3} {res} .00021779  
{txt}        58{c |} {space 3} {res} .23364865 {space 3} {res} .00547234 {space 3} {res} .00021749  
{txt}        59{c |} {space 3} {res} .21289195 {space 3} {res} .00547504 {space 3} {res} .00021723  
{txt}        60{c |} {space 3} {res} .19397921 {space 3} {res} .00547749 {space 3} {res}   .000217  
{txt}        61{c |} {space 3} {res} .17674663 {space 3} {res} .00547977 {space 3} {res}  .0002168  
{txt}        62{c |} {space 3} {res} .16104495 {space 3} {res} .00548186 {space 3} {res} .00021661  
{txt}        63{c |} {space 3} {res} .14673816 {space 3} {res} .00548379 {space 3} {res} .00021644  
{txt}        64{c |} {space 3} {res} .13370235 {space 3} {res} .00548546 {space 3} {res} .00021627  
{txt}        65{c |} {space 3} {res}  .1218246 {space 3} {res} .00548693 {space 3} {res} .00021611  
{txt}        66{c |} {space 3} {res} .11100204 {space 3} {res}  .0054883 {space 3} {res} .00021597  
{txt}        67{c |} {space 3} {res} .10114092 {space 3} {res} .00548956 {space 3} {res} .00021584  
{txt}        68{c |} {space 3} {res} .09215584 {space 3} {res}  .0054907 {space 3} {res} .00021572  
{txt}        69{c |} {space 3} {res} .08396897 {space 3} {res} .00549175 {space 3} {res} .00021561  
{txt}        70{c |} {space 3} {res}  .0765094 {space 3} {res} .00549272 {space 3} {res} .00021552  
{txt}        71{c |} {space 3} {res} .06971251 {space 3} {res}  .0054936 {space 3} {res} .00021543  
{txt}        72{c |} {space 3} {res} .06351945 {space 3} {res}  .0054944 {space 3} {res} .00021535  
{txt}        73{c |} {space 3} {res} .05787655 {space 3} {res} .00549514 {space 3} {res} .00021528  
{txt}        74{c |} {space 3} {res} .05273496 {space 3} {res} .00549581 {space 3} {res} .00021521  
{txt}        75{c |} {space 3} {res} .04805013 {space 3} {res} .00549642 {space 3} {res} .00021515  
{txt}        76{c |} {space 3} {res} .04378149 {space 3} {res} .00549698 {space 3} {res}  .0002151  
{txt}        77{c |} {space 3} {res} .03989206 {space 3} {res}  .0054975 {space 3} {res} .00021505  
{txt}        78{c |} {space 3} {res} .03634816 {space 3} {res} .00549796 {space 3} {res}   .000215  
{txt}        79{c |} {space 3} {res} .03311909 {space 3} {res} .00549839 {space 3} {res} .00021496  
{txt}        80{c |} {space 3} {res} .03017688 {space 3} {res} .00549878 {space 3} {res} .00021493  
{txt}        81{c |} {space 3} {res} .02749605 {space 3} {res} .00549914 {space 3} {res} .00021489  
{txt}        82{c |} {space 3} {res} .02505338 {space 3} {res} .00549946 {space 3} {res} .00021486  
{txt}        83{c |} {space 3} {res} .02282771 {space 3} {res} .00549976 {space 3} {res} .00021483  
{txt}        84{c |} {space 3} {res} .02079976 {space 3} {res} .00550003 {space 3} {res} .00021481  
{txt}        85{c |} {space 3} {res} .01895196 {space 3} {res} .00550027 {space 3} {res} .00021478  
{txt}        86{c |} {space 3} {res} .01726832 {space 3} {res}  .0055005 {space 3} {res} .00021476  
{txt}        87{c |} {space 3} {res} .01573425 {space 3} {res}  .0055007 {space 3} {res} .00021474  
{txt}        88{c |} {space 3} {res} .01433646 {space 3} {res} .00550089 {space 3} {res} .00021472  
{txt}        89{c |} {space 3} {res} .01306285 {space 3} {res} .00550106 {space 3} {res} .00021471  
{txt}        90{c |} {space 3} {res} .01190238 {space 3} {res} .00550121 {space 3} {res} .00021469  
{txt}        91{c |} {space 3} {res} .01084501 {space 3} {res} .00550136 {space 3} {res} .00021468  
{txt}        92{c |} {space 3} {res} .00988157 {space 3} {res} .00550148 {space 3} {res} .00021467  
{txt}        93{c |} {space 3} {res} .00900372 {space 3} {res}  .0055016 {space 3} {res} .00021466  
{txt}        94{c |} {space 3} {res} .00820385 {space 3} {res} .00550171 {space 3} {res} .00021465  
{txt}        95{c |} {space 3} {res} .00747504 {space 3} {res} .00550181 {space 3} {res} .00021464  
{txt}        96{c |} {space 3} {res} .00681098 {space 3} {res}  .0055019 {space 3} {res} .00021463  
{txt}        97{c |} {space 3} {res} .00620591 {space 3} {res} .00550198 {space 3} {res} .00021462  
{txt}        98{c |} {space 3} {res}  .0056546 {space 3} {res} .00550205 {space 3} {res} .00021461  
{txt}        99{c |} {space 3} {res} .00515226 {space 3} {res} .00550212 {space 3} {res} .00021461  
{txt}       100{c |} {space 3} {res} .00469455 {space 3} {res} .00550218 {space 3} {res}  .0002146  
{txt}* lopt = the lambda that minimizes MSPE.
  Run model: {stata cvlasso, lopt}
^ lse = largest lambda for which MSPE is within one standard error of the minimal MSPE.
  Run model: {stata cvlasso, lse}
r; t=1.07 12:42:16

{com}. assert "`e(noftools)'"=="noftools"
{txt}r; t=0.00 12:42:16

{com}. savedresults comp ftools e(), exclude(macros: lasso2opt)
{txt}r; t=0.01 12:42:16

{com}. 
. ********************************************************************************
. *** finish                                                                   ***
. ********************************************************************************
. 
. cap log close
{smcl}
{com}{sf}{ul off}